kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
#ifndef _REG_BLECORE_H_
#define _REG_BLECORE_H_

#include <stdint.h>

#include "_reg_blecore.h"
#include "arch.h"
#include "compiler.h"
#include "reg_access.h"

#define REG_BLECORE_COUNT 69

#define REG_BLECORE_DECODING_MASK 0x000001FF

/**
 * @brief RWBTLECNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31      MASTER_SOFT_RST   0
 *     30    MASTER_TGSOFT_RST   0
 *     29         REG_SOFT_RST   0
 *     26         RFTEST_ABORT   0
 *     25         ADVERT_ABORT   0
 *     24           SCAN_ABORT   0
 *     22               MD_DSB   0
 *     21               SN_DSB   0
 *     20             NESN_DSB   0
 *     19            CRYPT_DSB   0
 *     18             WHIT_DSB   0
 *     17              CRC_DSB   0
 *     16        HOP_REMAP_DSB   0
 *  15:14            CORR_MODE   0x0
 *     12          TXWINOFFSEL   0
 *     11         RXDESCPTRSEL   0
 *     10        ADVERRFILT_EN   0
 *     09            WLSYNC_EN   0
 *     08             RWBLE_EN   0
 *  07:04           RXWINSZDEF   0x0
 *  02:00              SYNCERR   0x0
 * </pre>
 */
#define BLE_RWBTLECNTL_ADDR 0x40000000
#define BLE_RWBTLECNTL_OFFSET 0x00000000
#define BLE_RWBTLECNTL_INDEX 0x00000000
#define BLE_RWBTLECNTL_RESET 0x00000000

__INLINE uint32_t ble_rwbtlecntl_get(void) {
  return REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
}

__INLINE void ble_rwbtlecntl_set(uint32_t value) {
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR, value);
}

// field definitions
#define BLE_MASTER_SOFT_RST_BIT ((uint32_t)0x80000000)
#define BLE_MASTER_SOFT_RST_POS 31
#define BLE_MASTER_TGSOFT_RST_BIT ((uint32_t)0x40000000)
#define BLE_MASTER_TGSOFT_RST_POS 30
#define BLE_REG_SOFT_RST_BIT ((uint32_t)0x20000000)
#define BLE_REG_SOFT_RST_POS 29
#define BLE_RFTEST_ABORT_BIT ((uint32_t)0x04000000)
#define BLE_RFTEST_ABORT_POS 26
#define BLE_ADVERT_ABORT_BIT ((uint32_t)0x02000000)
#define BLE_ADVERT_ABORT_POS 25
#define BLE_SCAN_ABORT_BIT ((uint32_t)0x01000000)
#define BLE_SCAN_ABORT_POS 24
#define BLE_MD_DSB_BIT ((uint32_t)0x00400000)
#define BLE_MD_DSB_POS 22
#define BLE_SN_DSB_BIT ((uint32_t)0x00200000)
#define BLE_SN_DSB_POS 21
#define BLE_NESN_DSB_BIT ((uint32_t)0x00100000)
#define BLE_NESN_DSB_POS 20
#define BLE_CRYPT_DSB_BIT ((uint32_t)0x00080000)
#define BLE_CRYPT_DSB_POS 19
#define BLE_WHIT_DSB_BIT ((uint32_t)0x00040000)
#define BLE_WHIT_DSB_POS 18
#define BLE_CRC_DSB_BIT ((uint32_t)0x00020000)
#define BLE_CRC_DSB_POS 17
#define BLE_HOP_REMAP_DSB_BIT ((uint32_t)0x00010000)
#define BLE_HOP_REMAP_DSB_POS 16
#define BLE_CORR_MODE_MASK ((uint32_t)0x0000C000)
#define BLE_CORR_MODE_LSB 14
#define BLE_CORR_MODE_WIDTH ((uint32_t)0x00000002)
#define BLE_TXWINOFFSEL_BIT ((uint32_t)0x00001000)
#define BLE_TXWINOFFSEL_POS 12
#define BLE_RXDESCPTRSEL_BIT ((uint32_t)0x00000800)
#define BLE_RXDESCPTRSEL_POS 11
#define BLE_ADVERRFILT_EN_BIT ((uint32_t)0x00000400)
#define BLE_ADVERRFILT_EN_POS 10
#define BLE_WLSYNC_EN_BIT ((uint32_t)0x00000200)
#define BLE_WLSYNC_EN_POS 9
#define BLE_RWBLE_EN_BIT ((uint32_t)0x00000100)
#define BLE_RWBLE_EN_POS 8
#define BLE_RXWINSZDEF_MASK ((uint32_t)0x000000F0)
#define BLE_RXWINSZDEF_LSB 4
#define BLE_RXWINSZDEF_WIDTH ((uint32_t)0x00000004)
#define BLE_SYNCERR_MASK ((uint32_t)0x00000007)
#define BLE_SYNCERR_LSB 0
#define BLE_SYNCERR_WIDTH ((uint32_t)0x00000003)

#define BLE_MASTER_SOFT_RST_RST 0x0
#define BLE_MASTER_TGSOFT_RST_RST 0x0
#define BLE_REG_SOFT_RST_RST 0x0
#define BLE_RFTEST_ABORT_RST 0x0
#define BLE_ADVERT_ABORT_RST 0x0
#define BLE_SCAN_ABORT_RST 0x0
#define BLE_MD_DSB_RST 0x0
#define BLE_SN_DSB_RST 0x0
#define BLE_NESN_DSB_RST 0x0
#define BLE_CRYPT_DSB_RST 0x0
#define BLE_WHIT_DSB_RST 0x0
#define BLE_CRC_DSB_RST 0x0
#define BLE_HOP_REMAP_DSB_RST 0x0
#define BLE_CORR_MODE_RST 0x0
#define BLE_TXWINOFFSEL_RST 0x0
#define BLE_RXDESCPTRSEL_RST 0x0
#define BLE_ADVERRFILT_EN_RST 0x0
#define BLE_WLSYNC_EN_RST 0x0
#define BLE_RWBLE_EN_RST 0x0
#define BLE_RXWINSZDEF_RST 0x0
#define BLE_SYNCERR_RST 0x0

__INLINE void ble_rwbtlecntl_pack(
    uint8_t mastersoftrst, uint8_t mastertgsoftrst, uint8_t regsoftrst,
    uint8_t rftestabort, uint8_t advertabort, uint8_t scanabort, uint8_t mddsb,
    uint8_t sndsb, uint8_t nesndsb, uint8_t cryptdsb, uint8_t whitdsb,
    uint8_t crcdsb, uint8_t hopremapdsb, uint8_t corrmode, uint8_t txwinoffsel,
    uint8_t rxdescptrsel, uint8_t adverrfilten, uint8_t wlsyncen,
    uint8_t rwbleen, uint8_t rxwinszdef, uint8_t syncerr) {
  ASSERT_ERR((((uint32_t)mastersoftrst << 31) & ~((uint32_t)0x80000000)) == 0);
  ASSERT_ERR((((uint32_t)mastertgsoftrst << 30) & ~((uint32_t)0x40000000)) ==
             0);
  ASSERT_ERR((((uint32_t)regsoftrst << 29) & ~((uint32_t)0x20000000)) == 0);
  ASSERT_ERR((((uint32_t)rftestabort << 26) & ~((uint32_t)0x04000000)) == 0);
  ASSERT_ERR((((uint32_t)advertabort << 25) & ~((uint32_t)0x02000000)) == 0);
  ASSERT_ERR((((uint32_t)scanabort << 24) & ~((uint32_t)0x01000000)) == 0);
  ASSERT_ERR((((uint32_t)mddsb << 22) & ~((uint32_t)0x00400000)) == 0);
  ASSERT_ERR((((uint32_t)sndsb << 21) & ~((uint32_t)0x00200000)) == 0);
  ASSERT_ERR((((uint32_t)nesndsb << 20) & ~((uint32_t)0x00100000)) == 0);
  ASSERT_ERR((((uint32_t)cryptdsb << 19) & ~((uint32_t)0x00080000)) == 0);
  ASSERT_ERR((((uint32_t)whitdsb << 18) & ~((uint32_t)0x00040000)) == 0);
  ASSERT_ERR((((uint32_t)crcdsb << 17) & ~((uint32_t)0x00020000)) == 0);
  ASSERT_ERR((((uint32_t)hopremapdsb << 16) & ~((uint32_t)0x00010000)) == 0);
  ASSERT_ERR((((uint32_t)corrmode << 14) & ~((uint32_t)0x0000C000)) == 0);
  ASSERT_ERR((((uint32_t)txwinoffsel << 12) & ~((uint32_t)0x00001000)) == 0);
  ASSERT_ERR((((uint32_t)rxdescptrsel << 11) & ~((uint32_t)0x00000800)) == 0);
  ASSERT_ERR((((uint32_t)adverrfilten << 10) & ~((uint32_t)0x00000400)) == 0);
  ASSERT_ERR((((uint32_t)wlsyncen << 9) & ~((uint32_t)0x00000200)) == 0);
  ASSERT_ERR((((uint32_t)rwbleen << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)rxwinszdef << 4) & ~((uint32_t)0x000000F0)) == 0);
  ASSERT_ERR((((uint32_t)syncerr << 0) & ~((uint32_t)0x00000007)) == 0);
  REG_BLE_WR(
      BLE_RWBTLECNTL_ADDR,
      ((uint32_t)mastersoftrst << 31) | ((uint32_t)mastertgsoftrst << 30) |
          ((uint32_t)regsoftrst << 29) | ((uint32_t)rftestabort << 26) |
          ((uint32_t)advertabort << 25) | ((uint32_t)scanabort << 24) |
          ((uint32_t)mddsb << 22) | ((uint32_t)sndsb << 21) |
          ((uint32_t)nesndsb << 20) | ((uint32_t)cryptdsb << 19) |
          ((uint32_t)whitdsb << 18) | ((uint32_t)crcdsb << 17) |
          ((uint32_t)hopremapdsb << 16) | ((uint32_t)corrmode << 14) |
          ((uint32_t)txwinoffsel << 12) | ((uint32_t)rxdescptrsel << 11) |
          ((uint32_t)adverrfilten << 10) | ((uint32_t)wlsyncen << 9) |
          ((uint32_t)rwbleen << 8) | ((uint32_t)rxwinszdef << 4) |
          ((uint32_t)syncerr << 0));
}

__INLINE void ble_rwbtlecntl_unpack(
    uint8_t* mastersoftrst, uint8_t* mastertgsoftrst, uint8_t* regsoftrst,
    uint8_t* rftestabort, uint8_t* advertabort, uint8_t* scanabort,
    uint8_t* mddsb, uint8_t* sndsb, uint8_t* nesndsb, uint8_t* cryptdsb,
    uint8_t* whitdsb, uint8_t* crcdsb, uint8_t* hopremapdsb, uint8_t* corrmode,
    uint8_t* txwinoffsel, uint8_t* rxdescptrsel, uint8_t* adverrfilten,
    uint8_t* wlsyncen, uint8_t* rwbleen, uint8_t* rxwinszdef,
    uint8_t* syncerr) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);

  *mastersoftrst = (localVal & ((uint32_t)0x80000000)) >> 31;
  *mastertgsoftrst = (localVal & ((uint32_t)0x40000000)) >> 30;
  *regsoftrst = (localVal & ((uint32_t)0x20000000)) >> 29;
  *rftestabort = (localVal & ((uint32_t)0x04000000)) >> 26;
  *advertabort = (localVal & ((uint32_t)0x02000000)) >> 25;
  *scanabort = (localVal & ((uint32_t)0x01000000)) >> 24;
  *mddsb = (localVal & ((uint32_t)0x00400000)) >> 22;
  *sndsb = (localVal & ((uint32_t)0x00200000)) >> 21;
  *nesndsb = (localVal & ((uint32_t)0x00100000)) >> 20;
  *cryptdsb = (localVal & ((uint32_t)0x00080000)) >> 19;
  *whitdsb = (localVal & ((uint32_t)0x00040000)) >> 18;
  *crcdsb = (localVal & ((uint32_t)0x00020000)) >> 17;
  *hopremapdsb = (localVal & ((uint32_t)0x00010000)) >> 16;
  *corrmode = (localVal & ((uint32_t)0x0000C000)) >> 14;
  *txwinoffsel = (localVal & ((uint32_t)0x00001000)) >> 12;
  *rxdescptrsel = (localVal & ((uint32_t)0x00000800)) >> 11;
  *adverrfilten = (localVal & ((uint32_t)0x00000400)) >> 10;
  *wlsyncen = (localVal & ((uint32_t)0x00000200)) >> 9;
  *rwbleen = (localVal & ((uint32_t)0x00000100)) >> 8;
  *rxwinszdef = (localVal & ((uint32_t)0x000000F0)) >> 4;
  *syncerr = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__INLINE uint8_t ble_master_soft_rst_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void ble_master_soft_rst_setf(uint8_t mastersoftrst) {
  ASSERT_ERR((((uint32_t)mastersoftrst << 31) & ~((uint32_t)0x80000000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x80000000)) |
                 ((uint32_t)mastersoftrst << 31));
}

__INLINE uint8_t ble_master_tgsoft_rst_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

