kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_master_tgsoft_rst_setf(uint8_t mastertgsoftrst) {
  ASSERT_ERR((((uint32_t)mastertgsoftrst << 30) & ~((uint32_t)0x40000000)) ==
             0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x40000000)) |
                 ((uint32_t)mastertgsoftrst << 30));
}

__INLINE uint8_t ble_reg_soft_rst_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__INLINE void ble_reg_soft_rst_setf(uint8_t regsoftrst) {
  ASSERT_ERR((((uint32_t)regsoftrst << 29) & ~((uint32_t)0x20000000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x20000000)) |
                 ((uint32_t)regsoftrst << 29));
}

__INLINE uint8_t ble_rftest_abort_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

__INLINE void ble_rftest_abort_setf(uint8_t rftestabort) {
  ASSERT_ERR((((uint32_t)rftestabort << 26) & ~((uint32_t)0x04000000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x04000000)) |
                 ((uint32_t)rftestabort << 26));
}

__INLINE uint8_t ble_advert_abort_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__INLINE void ble_advert_abort_setf(uint8_t advertabort) {
  ASSERT_ERR((((uint32_t)advertabort << 25) & ~((uint32_t)0x02000000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x02000000)) |
                 ((uint32_t)advertabort << 25));
}

__INLINE uint8_t ble_scan_abort_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__INLINE void ble_scan_abort_setf(uint8_t scanabort) {
  ASSERT_ERR((((uint32_t)scanabort << 24) & ~((uint32_t)0x01000000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x01000000)) |
                 ((uint32_t)scanabort << 24));
}

__INLINE uint8_t ble_md_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__INLINE void ble_md_dsb_setf(uint8_t mddsb) {
  ASSERT_ERR((((uint32_t)mddsb << 22) & ~((uint32_t)0x00400000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00400000)) |
                 ((uint32_t)mddsb << 22));
}

__INLINE uint8_t ble_sn_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void ble_sn_dsb_setf(uint8_t sndsb) {
  ASSERT_ERR((((uint32_t)sndsb << 21) & ~((uint32_t)0x00200000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00200000)) |
                 ((uint32_t)sndsb << 21));
}

__INLINE uint8_t ble_nesn_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void ble_nesn_dsb_setf(uint8_t nesndsb) {
  ASSERT_ERR((((uint32_t)nesndsb << 20) & ~((uint32_t)0x00100000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00100000)) |
                 ((uint32_t)nesndsb << 20));
}

__INLINE uint8_t ble_crypt_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_crypt_dsb_setf(uint8_t cryptdsb) {
  ASSERT_ERR((((uint32_t)cryptdsb << 19) & ~((uint32_t)0x00080000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00080000)) |
                 ((uint32_t)cryptdsb << 19));
}

__INLINE uint8_t ble_whit_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_whit_dsb_setf(uint8_t whitdsb) {
  ASSERT_ERR((((uint32_t)whitdsb << 18) & ~((uint32_t)0x00040000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00040000)) |
                 ((uint32_t)whitdsb << 18));
}

__INLINE uint8_t ble_crc_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void ble_crc_dsb_setf(uint8_t crcdsb) {
  ASSERT_ERR((((uint32_t)crcdsb << 17) & ~((uint32_t)0x00020000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00020000)) |
                 ((uint32_t)crcdsb << 17));
}

__INLINE uint8_t ble_hop_remap_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_hop_remap_dsb_setf(uint8_t hopremapdsb) {
  ASSERT_ERR((((uint32_t)hopremapdsb << 16) & ~((uint32_t)0x00010000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00010000)) |
                 ((uint32_t)hopremapdsb << 16));
}

__INLINE uint8_t ble_corr_mode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x0000C000)) >> 14);
}

__INLINE void ble_corr_mode_setf(uint8_t corrmode) {
  ASSERT_ERR((((uint32_t)corrmode << 14) & ~((uint32_t)0x0000C000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x0000C000)) |
                 ((uint32_t)corrmode << 14));
}

__INLINE uint8_t ble_txwinoffsel_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void ble_txwinoffsel_setf(uint8_t txwinoffsel) {
  ASSERT_ERR((((uint32_t)txwinoffsel << 12) & ~((uint32_t)0x00001000)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00001000)) |
                 ((uint32_t)txwinoffsel << 12));
}

__INLINE uint8_t ble_rxdescptrsel_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void ble_rxdescptrsel_setf(uint8_t rxdescptrsel) {
  ASSERT_ERR((((uint32_t)rxdescptrsel << 11) & ~((uint32_t)0x00000800)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00000800)) |
                 ((uint32_t)rxdescptrsel << 11));
}

__INLINE uint8_t ble_adverrfilt_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void ble_adverrfilt_en_setf(uint8_t adverrfilten) {
  ASSERT_ERR((((uint32_t)adverrfilten << 10) & ~((uint32_t)0x00000400)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00000400)) |
                 ((uint32_t)adverrfilten << 10));
}

__INLINE uint8_t ble_wlsync_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_wlsync_en_setf(uint8_t wlsyncen) {
  ASSERT_ERR((((uint32_t)wlsyncen << 9) & ~((uint32_t)0x00000200)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00000200)) |
                 ((uint32_t)wlsyncen << 9));
}

