kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_rwble_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_rwble_en_setf(uint8_t rwbleen) {
  ASSERT_ERR((((uint32_t)rwbleen << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)rwbleen << 8));
}

__INLINE uint8_t ble_rxwinszdef_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void ble_rxwinszdef_setf(uint8_t rxwinszdef) {
  ASSERT_ERR((((uint32_t)rxwinszdef << 4) & ~((uint32_t)0x000000F0)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x000000F0)) |
                 ((uint32_t)rxwinszdef << 4));
}

__INLINE uint8_t ble_syncerr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void ble_syncerr_setf(uint8_t syncerr) {
  ASSERT_ERR((((uint32_t)syncerr << 0) & ~((uint32_t)0x00000007)) == 0);
  REG_BLE_WR(BLE_RWBTLECNTL_ADDR,
             (REG_BLE_RD(BLE_RWBTLECNTL_ADDR) & ~((uint32_t)0x00000007)) |
                 ((uint32_t)syncerr << 0));
}

/**
 * @brief VERSION register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24                  TYP   0x6
 *  23:16                  REL   0x1
 *  15:08                  UPG   0xC
 *  07:00                BUILD   0x0
 * </pre>
 */
#define BLE_VERSION_ADDR 0x40000004
#define BLE_VERSION_OFFSET 0x00000004
#define BLE_VERSION_INDEX 0x00000001
#define BLE_VERSION_RESET 0x06010C00

__INLINE uint32_t ble_version_get(void) { return REG_BLE_RD(BLE_VERSION_ADDR); }

// field definitions
#define BLE_TYP_MASK ((uint32_t)0xFF000000)
#define BLE_TYP_LSB 24
#define BLE_TYP_WIDTH ((uint32_t)0x00000008)
#define BLE_REL_MASK ((uint32_t)0x00FF0000)
#define BLE_REL_LSB 16
#define BLE_REL_WIDTH ((uint32_t)0x00000008)
#define BLE_UPG_MASK ((uint32_t)0x0000FF00)
#define BLE_UPG_LSB 8
#define BLE_UPG_WIDTH ((uint32_t)0x00000008)
#define BLE_BUILD_MASK ((uint32_t)0x000000FF)
#define BLE_BUILD_LSB 0
#define BLE_BUILD_WIDTH ((uint32_t)0x00000008)

#define BLE_TYP_RST 0x6
#define BLE_REL_RST 0x1
#define BLE_UPG_RST 0xC
#define BLE_BUILD_RST 0x0

__INLINE void ble_version_unpack(uint8_t* typ, uint8_t* rel, uint8_t* upg,
                                 uint8_t* build) {
  uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);

  *typ = (localVal & ((uint32_t)0xFF000000)) >> 24;
  *rel = (localVal & ((uint32_t)0x00FF0000)) >> 16;
  *upg = (localVal & ((uint32_t)0x0000FF00)) >> 8;
  *build = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_typ_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
  return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE uint8_t ble_rel_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE uint8_t ble_upg_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE uint8_t ble_build_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_VERSION_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief RWBTLECONF register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:24            ADD_WIDTH   0xA
 *  22:16                 RFIF   0x1
 *  13:08              CLK_SEL   0xD
 *     05               DMMODE   0
 *     04              INTMODE   1
 *     03                 WLAN   1
 *     02               USEDBG   1
 *     01             USECRYPT   1
 *     00             BUSWIDTH   0
 * </pre>
 */
#define BLE_RWBTLECONF_ADDR 0x40000008
#define BLE_RWBTLECONF_OFFSET 0x00000008
#define BLE_RWBTLECONF_INDEX 0x00000002
#define BLE_RWBTLECONF_RESET 0x0A010D1E

__INLINE uint32_t ble_rwbtleconf_get(void) {
  return REG_BLE_RD(BLE_RWBTLECONF_ADDR);
}

// field definitions
#define BLE_ADD_WIDTH_MASK ((uint32_t)0x3F000000)
#define BLE_ADD_WIDTH_LSB 24
#define BLE_ADD_WIDTH_WIDTH ((uint32_t)0x00000006)
#define BLE_RFIF_MASK ((uint32_t)0x007F0000)
#define BLE_RFIF_LSB 16
#define BLE_RFIF_WIDTH ((uint32_t)0x00000007)
#define BLE_CLK_SEL_MASK ((uint32_t)0x00003F00)
#define BLE_CLK_SEL_LSB 8
#define BLE_CLK_SEL_WIDTH ((uint32_t)0x00000006)
#define BLE_DMMODE_BIT ((uint32_t)0x00000020)
#define BLE_DMMODE_POS 5
#define BLE_INTMODE_BIT ((uint32_t)0x00000010)
#define BLE_INTMODE_POS 4
#define BLE_WLAN_BIT ((uint32_t)0x00000008)
#define BLE_WLAN_POS 3
#define BLE_USEDBG_BIT ((uint32_t)0x00000004)
#define BLE_USEDBG_POS 2
#define BLE_USECRYPT_BIT ((uint32_t)0x00000002)
#define BLE_USECRYPT_POS 1
#define BLE_BUSWIDTH_BIT ((uint32_t)0x00000001)
#define BLE_BUSWIDTH_POS 0

#define BLE_ADD_WIDTH_RST 0xA
#define BLE_RFIF_RST 0x1
#define BLE_CLK_SEL_RST 0xD
#define BLE_DMMODE_RST 0x0
#define BLE_INTMODE_RST 0x1
#define BLE_WLAN_RST 0x1
#define BLE_USEDBG_RST 0x1
#define BLE_USECRYPT_RST 0x1
#define BLE_BUSWIDTH_RST 0x0

__INLINE void ble_rwbtleconf_unpack(uint8_t* addwidth, uint8_t* rfif,
                                    uint8_t* clksel, uint8_t* dmmode,
                                    uint8_t* intmode, uint8_t* wlan,
                                    uint8_t* usedbg, uint8_t* usecrypt,
                                    uint8_t* buswidth) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);

  *addwidth = (localVal & ((uint32_t)0x3F000000)) >> 24;
  *rfif = (localVal & ((uint32_t)0x007F0000)) >> 16;
  *clksel = (localVal & ((uint32_t)0x00003F00)) >> 8;
  *dmmode = (localVal & ((uint32_t)0x00000020)) >> 5;
  *intmode = (localVal & ((uint32_t)0x00000010)) >> 4;
  *wlan = (localVal & ((uint32_t)0x00000008)) >> 3;
  *usedbg = (localVal & ((uint32_t)0x00000004)) >> 2;
  *usecrypt = (localVal & ((uint32_t)0x00000002)) >> 1;
  *buswidth = (localVal & ((uint32_t)0x00000001)) >> 0;
}

