kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_add_width_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

__INLINE uint8_t ble_rfif_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

__INLINE uint8_t ble_clk_sel_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

__INLINE uint8_t ble_dmmode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE uint8_t ble_intmode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE uint8_t ble_wlan_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t ble_usedbg_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE uint8_t ble_usecrypt_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_buswidth_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RWBTLECONF_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief INTCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16             INCSCNTL   0xFFFF
 *     15          CSCNTDEVMSK   1
 *     08      RADIOCNTLINTMSK   0
 *     07      FINETGTIMINTMSK   0
 *     06     GROSSTGTIMINTMSK   0
 *     05          ERRORINTMSK   0
 *     04          CRYPTINTMSK   1
 *     03          EVENTINTMSK   1
 *     02            SLPINTMSK   1
 *     01             RXINTMSK   1
 *     00          CSCNTINTMSK   1
 * </pre>
 */
#define BLE_INTCNTL_ADDR 0x4000000C
#define BLE_INTCNTL_OFFSET 0x0000000C
#define BLE_INTCNTL_INDEX 0x00000003
#define BLE_INTCNTL_RESET 0xFFFF801F

__INLINE uint32_t ble_intcntl_get(void) { return REG_BLE_RD(BLE_INTCNTL_ADDR); }

__INLINE void ble_intcntl_set(uint32_t value) {
  REG_BLE_WR(BLE_INTCNTL_ADDR, value);
}

// field definitions
#define BLE_INCSCNTL_MASK ((uint32_t)0xFFFF0000)
#define BLE_INCSCNTL_LSB 16
#define BLE_INCSCNTL_WIDTH ((uint32_t)0x00000010)
#define BLE_CSCNTDEVMSK_BIT ((uint32_t)0x00008000)
#define BLE_CSCNTDEVMSK_POS 15
#define BLE_RADIOCNTLINTMSK_BIT ((uint32_t)0x00000100)
#define BLE_RADIOCNTLINTMSK_POS 8
#define BLE_FINETGTIMINTMSK_BIT ((uint32_t)0x00000080)
#define BLE_FINETGTIMINTMSK_POS 7
#define BLE_GROSSTGTIMINTMSK_BIT ((uint32_t)0x00000040)
#define BLE_GROSSTGTIMINTMSK_POS 6
#define BLE_ERRORINTMSK_BIT ((uint32_t)0x00000020)
#define BLE_ERRORINTMSK_POS 5
#define BLE_CRYPTINTMSK_BIT ((uint32_t)0x00000010)
#define BLE_CRYPTINTMSK_POS 4
#define BLE_EVENTINTMSK_BIT ((uint32_t)0x00000008)
#define BLE_EVENTINTMSK_POS 3
#define BLE_SLPINTMSK_BIT ((uint32_t)0x00000004)
#define BLE_SLPINTMSK_POS 2
#define BLE_RXINTMSK_BIT ((uint32_t)0x00000002)
#define BLE_RXINTMSK_POS 1
#define BLE_CSCNTINTMSK_BIT ((uint32_t)0x00000001)
#define BLE_CSCNTINTMSK_POS 0

#define BLE_INCSCNTL_RST 0xFFFF
#define BLE_CSCNTDEVMSK_RST 0x1
#define BLE_RADIOCNTLINTMSK_RST 0x0
#define BLE_FINETGTIMINTMSK_RST 0x0
#define BLE_GROSSTGTIMINTMSK_RST 0x0
#define BLE_ERRORINTMSK_RST 0x0
#define BLE_CRYPTINTMSK_RST 0x1
#define BLE_EVENTINTMSK_RST 0x1
#define BLE_SLPINTMSK_RST 0x1
#define BLE_RXINTMSK_RST 0x1
#define BLE_CSCNTINTMSK_RST 0x1

__INLINE void ble_intcntl_pack(uint16_t incscntl, uint8_t cscntdevmsk,
                               uint8_t radiocntlintmsk, uint8_t finetgtimintmsk,
                               uint8_t grosstgtimintmsk, uint8_t errorintmsk,
                               uint8_t cryptintmsk, uint8_t eventintmsk,
                               uint8_t slpintmsk, uint8_t rxintmsk,
                               uint8_t cscntintmsk) {
  ASSERT_ERR((((uint32_t)incscntl << 16) & ~((uint32_t)0xFFFF0000)) == 0);
  ASSERT_ERR((((uint32_t)cscntdevmsk << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)radiocntlintmsk << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)finetgtimintmsk << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)grosstgtimintmsk << 6) & ~((uint32_t)0x00000040)) ==
             0);
  ASSERT_ERR((((uint32_t)errorintmsk << 5) & ~((uint32_t)0x00000020)) == 0);
  ASSERT_ERR((((uint32_t)cryptintmsk << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)eventintmsk << 3) & ~((uint32_t)0x00000008)) == 0);
  ASSERT_ERR((((uint32_t)slpintmsk << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)rxintmsk << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)cscntintmsk << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             ((uint32_t)incscntl << 16) | ((uint32_t)cscntdevmsk << 15) |
                 ((uint32_t)radiocntlintmsk << 8) |
                 ((uint32_t)finetgtimintmsk << 7) |
                 ((uint32_t)grosstgtimintmsk << 6) |
                 ((uint32_t)errorintmsk << 5) | ((uint32_t)cryptintmsk << 4) |
                 ((uint32_t)eventintmsk << 3) | ((uint32_t)slpintmsk << 2) |
                 ((uint32_t)rxintmsk << 1) | ((uint32_t)cscntintmsk << 0));
}

__INLINE void ble_intcntl_unpack(uint16_t* incscntl, uint8_t* cscntdevmsk,
                                 uint8_t* radiocntlintmsk,
                                 uint8_t* finetgtimintmsk,
                                 uint8_t* grosstgtimintmsk,
                                 uint8_t* errorintmsk, uint8_t* cryptintmsk,
                                 uint8_t* eventintmsk, uint8_t* slpintmsk,
                                 uint8_t* rxintmsk, uint8_t* cscntintmsk) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);

  *incscntl = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
  *cscntdevmsk = (localVal & ((uint32_t)0x00008000)) >> 15;
  *radiocntlintmsk = (localVal & ((uint32_t)0x00000100)) >> 8;
  *finetgtimintmsk = (localVal & ((uint32_t)0x00000080)) >> 7;
  *grosstgtimintmsk = (localVal & ((uint32_t)0x00000040)) >> 6;
  *errorintmsk = (localVal & ((uint32_t)0x00000020)) >> 5;
  *cryptintmsk = (localVal & ((uint32_t)0x00000010)) >> 4;
  *eventintmsk = (localVal & ((uint32_t)0x00000008)) >> 3;
  *slpintmsk = (localVal & ((uint32_t)0x00000004)) >> 2;
  *rxintmsk = (localVal & ((uint32_t)0x00000002)) >> 1;
  *cscntintmsk = (localVal & ((uint32_t)0x00000001)) >> 0;
}

