kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint16_t ble_incscntl_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_incscntl_setf(uint16_t incscntl) {
  ASSERT_ERR((((uint32_t)incscntl << 16) & ~((uint32_t)0xFFFF0000)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0xFFFF0000)) |
                 ((uint32_t)incscntl << 16));
}

__INLINE uint8_t ble_cscntdevmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_cscntdevmsk_setf(uint8_t cscntdevmsk) {
  ASSERT_ERR((((uint32_t)cscntdevmsk << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)cscntdevmsk << 15));
}

__INLINE uint8_t ble_radiocntlintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_radiocntlintmsk_setf(uint8_t radiocntlintmsk) {
  ASSERT_ERR((((uint32_t)radiocntlintmsk << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)radiocntlintmsk << 8));
}

__INLINE uint8_t ble_finetgtimintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_finetgtimintmsk_setf(uint8_t finetgtimintmsk) {
  ASSERT_ERR((((uint32_t)finetgtimintmsk << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)finetgtimintmsk << 7));
}

__INLINE uint8_t ble_grosstgtimintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void ble_grosstgtimintmsk_setf(uint8_t grosstgtimintmsk) {
  ASSERT_ERR((((uint32_t)grosstgtimintmsk << 6) & ~((uint32_t)0x00000040)) ==
             0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000040)) |
                 ((uint32_t)grosstgtimintmsk << 6));
}

__INLINE uint8_t ble_errorintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void ble_errorintmsk_setf(uint8_t errorintmsk) {
  ASSERT_ERR((((uint32_t)errorintmsk << 5) & ~((uint32_t)0x00000020)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000020)) |
                 ((uint32_t)errorintmsk << 5));
}

__INLINE uint8_t ble_cryptintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_cryptintmsk_setf(uint8_t cryptintmsk) {
  ASSERT_ERR((((uint32_t)cryptintmsk << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)cryptintmsk << 4));
}

__INLINE uint8_t ble_eventintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_eventintmsk_setf(uint8_t eventintmsk) {
  ASSERT_ERR((((uint32_t)eventintmsk << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000008)) |
                 ((uint32_t)eventintmsk << 3));
}

__INLINE uint8_t ble_slpintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_slpintmsk_setf(uint8_t slpintmsk) {
  ASSERT_ERR((((uint32_t)slpintmsk << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)slpintmsk << 2));
}

__INLINE uint8_t ble_rxintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_rxintmsk_setf(uint8_t rxintmsk) {
  ASSERT_ERR((((uint32_t)rxintmsk << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)rxintmsk << 1));
}

__INLINE uint8_t ble_cscntintmsk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_cscntintmsk_setf(uint8_t cscntintmsk) {
  ASSERT_ERR((((uint32_t)cscntintmsk << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_INTCNTL_ADDR,
             (REG_BLE_RD(BLE_INTCNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)cscntintmsk << 0));
}

/**
 * @brief INTSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08     RADIOCNTLINTSTAT   0
 *     07     FINETGTIMINTSTAT   0
 *     06    GROSSTGTIMINTSTAT   0
 *     05         ERRORINTSTAT   0
 *     04         CRYPTINTSTAT   0
 *     03         EVENTINTSTAT   0
 *     02           SLPINTSTAT   0
 *     01            RXINTSTAT   0
 *     00         CSCNTINTSTAT   0
 * </pre>
 */
#define BLE_INTSTAT_ADDR 0x40000010
#define BLE_INTSTAT_OFFSET 0x00000010
#define BLE_INTSTAT_INDEX 0x00000004
#define BLE_INTSTAT_RESET 0x00000000

__INLINE uint32_t ble_intstat_get(void) { return REG_BLE_RD(BLE_INTSTAT_ADDR); }

// field definitions
#define BLE_RADIOCNTLINTSTAT_BIT ((uint32_t)0x00000100)
#define BLE_RADIOCNTLINTSTAT_POS 8
#define BLE_FINETGTIMINTSTAT_BIT ((uint32_t)0x00000080)
#define BLE_FINETGTIMINTSTAT_POS 7
#define BLE_GROSSTGTIMINTSTAT_BIT ((uint32_t)0x00000040)
#define BLE_GROSSTGTIMINTSTAT_POS 6
#define BLE_ERRORINTSTAT_BIT ((uint32_t)0x00000020)
#define BLE_ERRORINTSTAT_POS 5
#define BLE_CRYPTINTSTAT_BIT ((uint32_t)0x00000010)
#define BLE_CRYPTINTSTAT_POS 4
#define BLE_EVENTINTSTAT_BIT ((uint32_t)0x00000008)
#define BLE_EVENTINTSTAT_POS 3
#define BLE_SLPINTSTAT_BIT ((uint32_t)0x00000004)
#define BLE_SLPINTSTAT_POS 2
#define BLE_RXINTSTAT_BIT ((uint32_t)0x00000002)
#define BLE_RXINTSTAT_POS 1
#define BLE_CSCNTINTSTAT_BIT ((uint32_t)0x00000001)
#define BLE_CSCNTINTSTAT_POS 0

#define BLE_RADIOCNTLINTSTAT_RST 0x0
#define BLE_FINETGTIMINTSTAT_RST 0x0
#define BLE_GROSSTGTIMINTSTAT_RST 0x0
#define BLE_ERRORINTSTAT_RST 0x0
#define BLE_CRYPTINTSTAT_RST 0x0
#define BLE_EVENTINTSTAT_RST 0x0
#define BLE_SLPINTSTAT_RST 0x0
#define BLE_RXINTSTAT_RST 0x0
#define BLE_CSCNTINTSTAT_RST 0x0

__INLINE void ble_intstat_unpack(uint8_t* radiocntlintstat,
                                 uint8_t* finetgtimintstat,
                                 uint8_t* grosstgtimintstat,
                                 uint8_t* errorintstat, uint8_t* cryptintstat,
                                 uint8_t* eventintstat, uint8_t* slpintstat,
                                 uint8_t* rxintstat, uint8_t* cscntintstat) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);

  *radiocntlintstat = (localVal & ((uint32_t)0x00000100)) >> 8;
  *finetgtimintstat = (localVal & ((uint32_t)0x00000080)) >> 7;
  *grosstgtimintstat = (localVal & ((uint32_t)0x00000040)) >> 6;
  *errorintstat = (localVal & ((uint32_t)0x00000020)) >> 5;
  *cryptintstat = (localVal & ((uint32_t)0x00000010)) >> 4;
  *eventintstat = (localVal & ((uint32_t)0x00000008)) >> 3;
  *slpintstat = (localVal & ((uint32_t)0x00000004)) >> 2;
  *rxintstat = (localVal & ((uint32_t)0x00000002)) >> 1;
  *cscntintstat = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_radiocntlintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE uint8_t ble_finetgtimintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE uint8_t ble_grosstgtimintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

