kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_errorintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE uint8_t ble_cryptintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE uint8_t ble_eventintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t ble_slpintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE uint8_t ble_rxintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_cscntintstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief INTRAWSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08   RADIOCNTLINTRAWSTAT   0
 *     07   FINETGTIMINTRAWSTAT   0
 *     06   GROSSTGTIMINTRAWSTAT   0
 *     05      ERRORINTRAWSTAT   0
 *     04      CRYPTINTRAWSTAT   0
 *     03      EVENTINTRAWSTAT   0
 *     02        SLPINTRAWSTAT   0
 *     01         RXINTRAWSTAT   0
 *     00      CSCNTINTRAWSTAT   0
 * </pre>
 */
#define BLE_INTRAWSTAT_ADDR 0x40000014
#define BLE_INTRAWSTAT_OFFSET 0x00000014
#define BLE_INTRAWSTAT_INDEX 0x00000005
#define BLE_INTRAWSTAT_RESET 0x00000000

__INLINE uint32_t ble_intrawstat_get(void) {
  return REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
}

// field definitions
#define BLE_RADIOCNTLINTRAWSTAT_BIT ((uint32_t)0x00000100)
#define BLE_RADIOCNTLINTRAWSTAT_POS 8
#define BLE_FINETGTIMINTRAWSTAT_BIT ((uint32_t)0x00000080)
#define BLE_FINETGTIMINTRAWSTAT_POS 7
#define BLE_GROSSTGTIMINTRAWSTAT_BIT ((uint32_t)0x00000040)
#define BLE_GROSSTGTIMINTRAWSTAT_POS 6
#define BLE_ERRORINTRAWSTAT_BIT ((uint32_t)0x00000020)
#define BLE_ERRORINTRAWSTAT_POS 5
#define BLE_CRYPTINTRAWSTAT_BIT ((uint32_t)0x00000010)
#define BLE_CRYPTINTRAWSTAT_POS 4
#define BLE_EVENTINTRAWSTAT_BIT ((uint32_t)0x00000008)
#define BLE_EVENTINTRAWSTAT_POS 3
#define BLE_SLPINTRAWSTAT_BIT ((uint32_t)0x00000004)
#define BLE_SLPINTRAWSTAT_POS 2
#define BLE_RXINTRAWSTAT_BIT ((uint32_t)0x00000002)
#define BLE_RXINTRAWSTAT_POS 1
#define BLE_CSCNTINTRAWSTAT_BIT ((uint32_t)0x00000001)
#define BLE_CSCNTINTRAWSTAT_POS 0

#define BLE_RADIOCNTLINTRAWSTAT_RST 0x0
#define BLE_FINETGTIMINTRAWSTAT_RST 0x0
#define BLE_GROSSTGTIMINTRAWSTAT_RST 0x0
#define BLE_ERRORINTRAWSTAT_RST 0x0
#define BLE_CRYPTINTRAWSTAT_RST 0x0
#define BLE_EVENTINTRAWSTAT_RST 0x0
#define BLE_SLPINTRAWSTAT_RST 0x0
#define BLE_RXINTRAWSTAT_RST 0x0
#define BLE_CSCNTINTRAWSTAT_RST 0x0

__INLINE void ble_intrawstat_unpack(
    uint8_t* radiocntlintrawstat, uint8_t* finetgtimintrawstat,
    uint8_t* grosstgtimintrawstat, uint8_t* errorintrawstat,
    uint8_t* cryptintrawstat, uint8_t* eventintrawstat, uint8_t* slpintrawstat,
    uint8_t* rxintrawstat, uint8_t* cscntintrawstat) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);

  *radiocntlintrawstat = (localVal & ((uint32_t)0x00000100)) >> 8;
  *finetgtimintrawstat = (localVal & ((uint32_t)0x00000080)) >> 7;
  *grosstgtimintrawstat = (localVal & ((uint32_t)0x00000040)) >> 6;
  *errorintrawstat = (localVal & ((uint32_t)0x00000020)) >> 5;
  *cryptintrawstat = (localVal & ((uint32_t)0x00000010)) >> 4;
  *eventintrawstat = (localVal & ((uint32_t)0x00000008)) >> 3;
  *slpintrawstat = (localVal & ((uint32_t)0x00000004)) >> 2;
  *rxintrawstat = (localVal & ((uint32_t)0x00000002)) >> 1;
  *cscntintrawstat = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_radiocntlintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE uint8_t ble_finetgtimintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE uint8_t ble_grosstgtimintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE uint8_t ble_errorintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE uint8_t ble_cryptintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE uint8_t ble_eventintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t ble_slpintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE uint8_t ble_rxintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_cscntintrawstat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTRAWSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief INTACK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     08      RADIOCNTLINTACK   0
 *     07      FINETGTIMINTACK   0
 *     06     GROSSTGTIMINTACK   0
 *     05          ERRORINTACK   0
 *     04          CRYPTINTACK   0
 *     03          EVENTINTACK   0
 *     02            SLPINTACK   0
 *     01             RXINTACK   0
 *     00          CSCNTINTACK   0
 * </pre>
 */
#define BLE_INTACK_ADDR 0x40000018
#define BLE_INTACK_OFFSET 0x00000018
#define BLE_INTACK_INDEX 0x00000006
#define BLE_INTACK_RESET 0x00000000

__INLINE uint32_t ble_intack_get(void) { return REG_BLE_RD(BLE_INTACK_ADDR); }

__INLINE void ble_intack_clear(uint32_t value) {
  REG_BLE_WR(BLE_INTACK_ADDR, value);
}

// field definitions
#define BLE_RADIOCNTLINTACK_BIT ((uint32_t)0x00000100)
#define BLE_RADIOCNTLINTACK_POS 8
#define BLE_FINETGTIMINTACK_BIT ((uint32_t)0x00000080)
#define BLE_FINETGTIMINTACK_POS 7
#define BLE_GROSSTGTIMINTACK_BIT ((uint32_t)0x00000040)
#define BLE_GROSSTGTIMINTACK_POS 6
#define BLE_ERRORINTACK_BIT ((uint32_t)0x00000020)
#define BLE_ERRORINTACK_POS 5
#define BLE_CRYPTINTACK_BIT ((uint32_t)0x00000010)
#define BLE_CRYPTINTACK_POS 4
#define BLE_EVENTINTACK_BIT ((uint32_t)0x00000008)
#define BLE_EVENTINTACK_POS 3
#define BLE_SLPINTACK_BIT ((uint32_t)0x00000004)
#define BLE_SLPINTACK_POS 2
#define BLE_RXINTACK_BIT ((uint32_t)0x00000002)
#define BLE_RXINTACK_POS 1
#define BLE_CSCNTINTACK_BIT ((uint32_t)0x00000001)
#define BLE_CSCNTINTACK_POS 0

