kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
#define BLE_RADIOCNTLINTACK_RST 0x0
#define BLE_FINETGTIMINTACK_RST 0x0
#define BLE_GROSSTGTIMINTACK_RST 0x0
#define BLE_ERRORINTACK_RST 0x0
#define BLE_CRYPTINTACK_RST 0x0
#define BLE_EVENTINTACK_RST 0x0
#define BLE_SLPINTACK_RST 0x0
#define BLE_RXINTACK_RST 0x0
#define BLE_CSCNTINTACK_RST 0x0

__INLINE void ble_intack_pack(uint8_t radiocntlintack, uint8_t finetgtimintack,
                              uint8_t grosstgtimintack, uint8_t errorintack,
                              uint8_t cryptintack, uint8_t eventintack,
                              uint8_t slpintack, uint8_t rxintack,
                              uint8_t cscntintack) {
  ASSERT_ERR((((uint32_t)radiocntlintack << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)finetgtimintack << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)grosstgtimintack << 6) & ~((uint32_t)0x00000040)) ==
             0);
  ASSERT_ERR((((uint32_t)errorintack << 5) & ~((uint32_t)0x00000020)) == 0);
  ASSERT_ERR((((uint32_t)cryptintack << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)eventintack << 3) & ~((uint32_t)0x00000008)) == 0);
  ASSERT_ERR((((uint32_t)slpintack << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)rxintack << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)cscntintack << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR,
             ((uint32_t)radiocntlintack << 8) |
                 ((uint32_t)finetgtimintack << 7) |
                 ((uint32_t)grosstgtimintack << 6) |
                 ((uint32_t)errorintack << 5) | ((uint32_t)cryptintack << 4) |
                 ((uint32_t)eventintack << 3) | ((uint32_t)slpintack << 2) |
                 ((uint32_t)rxintack << 1) | ((uint32_t)cscntintack << 0));
}

__INLINE void ble_intack_unpack(uint8_t* radiocntlintack,
                                uint8_t* finetgtimintack,
                                uint8_t* grosstgtimintack, uint8_t* errorintack,
                                uint8_t* cryptintack, uint8_t* eventintack,
                                uint8_t* slpintack, uint8_t* rxintack,
                                uint8_t* cscntintack) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);

  *radiocntlintack = (localVal & ((uint32_t)0x00000100)) >> 8;
  *finetgtimintack = (localVal & ((uint32_t)0x00000080)) >> 7;
  *grosstgtimintack = (localVal & ((uint32_t)0x00000040)) >> 6;
  *errorintack = (localVal & ((uint32_t)0x00000020)) >> 5;
  *cryptintack = (localVal & ((uint32_t)0x00000010)) >> 4;
  *eventintack = (localVal & ((uint32_t)0x00000008)) >> 3;
  *slpintack = (localVal & ((uint32_t)0x00000004)) >> 2;
  *rxintack = (localVal & ((uint32_t)0x00000002)) >> 1;
  *cscntintack = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_radiocntlintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_radiocntlintack_clearf(uint8_t radiocntlintack) {
  ASSERT_ERR((((uint32_t)radiocntlintack << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)radiocntlintack << 8);
}

__INLINE uint8_t ble_finetgtimintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_finetgtimintack_clearf(uint8_t finetgtimintack) {
  ASSERT_ERR((((uint32_t)finetgtimintack << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)finetgtimintack << 7);
}

__INLINE uint8_t ble_grosstgtimintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void ble_grosstgtimintack_clearf(uint8_t grosstgtimintack) {
  ASSERT_ERR((((uint32_t)grosstgtimintack << 6) & ~((uint32_t)0x00000040)) ==
             0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)grosstgtimintack << 6);
}

__INLINE uint8_t ble_errorintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void ble_errorintack_clearf(uint8_t errorintack) {
  ASSERT_ERR((((uint32_t)errorintack << 5) & ~((uint32_t)0x00000020)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)errorintack << 5);
}

__INLINE uint8_t ble_cryptintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_cryptintack_clearf(uint8_t cryptintack) {
  ASSERT_ERR((((uint32_t)cryptintack << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)cryptintack << 4);
}

__INLINE uint8_t ble_eventintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_eventintack_clearf(uint8_t eventintack) {
  ASSERT_ERR((((uint32_t)eventintack << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)eventintack << 3);
}

__INLINE uint8_t ble_slpintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_slpintack_clearf(uint8_t slpintack) {
  ASSERT_ERR((((uint32_t)slpintack << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)slpintack << 2);
}

__INLINE uint8_t ble_rxintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_rxintack_clearf(uint8_t rxintack) {
  ASSERT_ERR((((uint32_t)rxintack << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)rxintack << 1);
}

__INLINE uint8_t ble_cscntintack_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_INTACK_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_cscntintack_clearf(uint8_t cscntintack) {
  ASSERT_ERR((((uint32_t)cscntintack << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_INTACK_ADDR, (uint32_t)cscntintack << 0);
}

/**
 * @brief BASETIMECNT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  26:00          BASETIMECNT   0x0
 * </pre>
 */
#define BLE_BASETIMECNT_ADDR 0x4000001C
#define BLE_BASETIMECNT_OFFSET 0x0000001C
#define BLE_BASETIMECNT_INDEX 0x00000007
#define BLE_BASETIMECNT_RESET 0x00000000

__INLINE uint32_t ble_basetimecnt_get(void) {
  return REG_BLE_RD(BLE_BASETIMECNT_ADDR);
}

