kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_BASETIMECNT_MASK ((uint32_t)0x07FFFFFF)
#define BLE_BASETIMECNT_LSB 0
#define BLE_BASETIMECNT_WIDTH ((uint32_t)0x0000001B)

#define BLE_BASETIMECNT_RST 0x0

__INLINE uint32_t ble_basetimecnt_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BASETIMECNT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x07FFFFFF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief FINETIMECNT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00              FINECNT   0x0
 * </pre>
 */
#define BLE_FINETIMECNT_ADDR 0x40000020
#define BLE_FINETIMECNT_OFFSET 0x00000020
#define BLE_FINETIMECNT_INDEX 0x00000008
#define BLE_FINETIMECNT_RESET 0x00000000

__INLINE uint32_t ble_finetimecnt_get(void) {
  return REG_BLE_RD(BLE_FINETIMECNT_ADDR);
}

// field definitions
#define BLE_FINECNT_MASK ((uint32_t)0x000003FF)
#define BLE_FINECNT_LSB 0
#define BLE_FINECNT_WIDTH ((uint32_t)0x0000000A)

#define BLE_FINECNT_RST 0x0

__INLINE uint16_t ble_finecnt_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_FINETIMECNT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief BDADDRL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00              BDADDRL   0x0
 * </pre>
 */
#define BLE_BDADDRL_ADDR 0x40000024
#define BLE_BDADDRL_OFFSET 0x00000024
#define BLE_BDADDRL_INDEX 0x00000009
#define BLE_BDADDRL_RESET 0x00000000

__INLINE uint32_t ble_bdaddrl_get(void) { return REG_BLE_RD(BLE_BDADDRL_ADDR); }

__INLINE void ble_bdaddrl_set(uint32_t value) {
  REG_BLE_WR(BLE_BDADDRL_ADDR, value);
}

// field definitions
#define BLE_BDADDRL_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_BDADDRL_LSB 0
#define BLE_BDADDRL_WIDTH ((uint32_t)0x00000020)

#define BLE_BDADDRL_RST 0x0

__INLINE uint32_t ble_bdaddrl_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BDADDRL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_bdaddrl_setf(uint32_t bdaddrl) {
  ASSERT_ERR((((uint32_t)bdaddrl << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_BDADDRL_ADDR, (uint32_t)bdaddrl << 0);
}

/**
 * @brief BDADDRU register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     16            PRIV_NPUB   0
 *  15:00              BDADDRU   0x0
 * </pre>
 */
#define BLE_BDADDRU_ADDR 0x40000028
#define BLE_BDADDRU_OFFSET 0x00000028
#define BLE_BDADDRU_INDEX 0x0000000A
#define BLE_BDADDRU_RESET 0x00000000

__INLINE uint32_t ble_bdaddru_get(void) { return REG_BLE_RD(BLE_BDADDRU_ADDR); }

__INLINE void ble_bdaddru_set(uint32_t value) {
  REG_BLE_WR(BLE_BDADDRU_ADDR, value);
}

// field definitions
#define BLE_PRIV_NPUB_BIT ((uint32_t)0x00010000)
#define BLE_PRIV_NPUB_POS 16
#define BLE_BDADDRU_MASK ((uint32_t)0x0000FFFF)
#define BLE_BDADDRU_LSB 0
#define BLE_BDADDRU_WIDTH ((uint32_t)0x00000010)

#define BLE_PRIV_NPUB_RST 0x0
#define BLE_BDADDRU_RST 0x0

__INLINE void ble_bdaddru_pack(uint8_t privnpub, uint16_t bdaddru) {
  ASSERT_ERR((((uint32_t)privnpub << 16) & ~((uint32_t)0x00010000)) == 0);
  ASSERT_ERR((((uint32_t)bdaddru << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_BDADDRU_ADDR,
             ((uint32_t)privnpub << 16) | ((uint32_t)bdaddru << 0));
}

__INLINE void ble_bdaddru_unpack(uint8_t* privnpub, uint16_t* bdaddru) {
  uint32_t localVal = REG_BLE_RD(BLE_BDADDRU_ADDR);

  *privnpub = (localVal & ((uint32_t)0x00010000)) >> 16;
  *bdaddru = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint8_t ble_priv_npub_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BDADDRU_ADDR);
  return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_priv_npub_setf(uint8_t privnpub) {
  ASSERT_ERR((((uint32_t)privnpub << 16) & ~((uint32_t)0x00010000)) == 0);
  REG_BLE_WR(BLE_BDADDRU_ADDR,
             (REG_BLE_RD(BLE_BDADDRU_ADDR) & ~((uint32_t)0x00010000)) |
                 ((uint32_t)privnpub << 16));
}

__INLINE uint16_t ble_bdaddru_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BDADDRU_ADDR);
  return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_bdaddru_setf(uint16_t bdaddru) {
  ASSERT_ERR((((uint32_t)bdaddru << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_BDADDRU_ADDR,
             (REG_BLE_RD(BLE_BDADDRU_ADDR) & ~((uint32_t)0x0000FFFF)) |
                 ((uint32_t)bdaddru << 0));
}

/**
 * @brief CURRENTRXDESCPTR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:00     CURRENTRXDESCPTR   0x0
 * </pre>
 */
#define BLE_CURRENTRXDESCPTR_ADDR 0x4000002C
#define BLE_CURRENTRXDESCPTR_OFFSET 0x0000002C
#define BLE_CURRENTRXDESCPTR_INDEX 0x0000000B
#define BLE_CURRENTRXDESCPTR_RESET 0x00000000

__INLINE uint32_t ble_currentrxdescptr_get(void) {
  return REG_BLE_RD(BLE_CURRENTRXDESCPTR_ADDR);
}

__INLINE void ble_currentrxdescptr_set(uint32_t value) {
  REG_BLE_WR(BLE_CURRENTRXDESCPTR_ADDR, value);
}

// field definitions
#define BLE_CURRENTRXDESCPTR_MASK ((uint32_t)0x00003FFF)
#define BLE_CURRENTRXDESCPTR_LSB 0
#define BLE_CURRENTRXDESCPTR_WIDTH ((uint32_t)0x0000000E)

#define BLE_CURRENTRXDESCPTR_RST 0x0

__INLINE uint16_t ble_currentrxdescptr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_CURRENTRXDESCPTR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00003FFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_currentrxdescptr_setf(uint16_t currentrxdescptr) {
  ASSERT_ERR((((uint32_t)currentrxdescptr << 0) & ~((uint32_t)0x00003FFF)) ==
             0);
  REG_BLE_WR(BLE_CURRENTRXDESCPTR_ADDR, (uint32_t)currentrxdescptr << 0);
}

#if RW_BLE_SUPPORT
/**
 * @brief DEEPSLCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31           EXTWKUPDSB   0
 *     15      DEEP_SLEEP_STAT   0
 *     04      SOFT_WAKEUP_REQ   0
 *     03   DEEP_SLEEP_CORR_EN   0
 *     02        DEEP_SLEEP_ON   0
 *     01       RADIO_SLEEP_EN   0
 *     00         OSC_SLEEP_EN   0
 * </pre>
 */
#define BLE_DEEPSLCNTL_ADDR 0x40000030
#define BLE_DEEPSLCNTL_OFFSET 0x00000030
#define BLE_DEEPSLCNTL_INDEX 0x0000000C
#define BLE_DEEPSLCNTL_RESET 0x00000000

__INLINE uint32_t ble_deepslcntl_get(void) {
  return REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
}

__INLINE void ble_deepslcntl_set(uint32_t value) {
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR, value);
}

