kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_EXTWKUPDSB_BIT ((uint32_t)0x80000000)
#define BLE_EXTWKUPDSB_POS 31
#define BLE_DEEP_SLEEP_STAT_BIT ((uint32_t)0x00008000)
#define BLE_DEEP_SLEEP_STAT_POS 15
#define BLE_SOFT_WAKEUP_REQ_BIT ((uint32_t)0x00000010)
#define BLE_SOFT_WAKEUP_REQ_POS 4
#define BLE_DEEP_SLEEP_CORR_EN_BIT ((uint32_t)0x00000008)
#define BLE_DEEP_SLEEP_CORR_EN_POS 3
#define BLE_DEEP_SLEEP_ON_BIT ((uint32_t)0x00000004)
#define BLE_DEEP_SLEEP_ON_POS 2
#define BLE_RADIO_SLEEP_EN_BIT ((uint32_t)0x00000002)
#define BLE_RADIO_SLEEP_EN_POS 1
#define BLE_OSC_SLEEP_EN_BIT ((uint32_t)0x00000001)
#define BLE_OSC_SLEEP_EN_POS 0

#define BLE_EXTWKUPDSB_RST 0x0
#define BLE_DEEP_SLEEP_STAT_RST 0x0
#define BLE_SOFT_WAKEUP_REQ_RST 0x0
#define BLE_DEEP_SLEEP_CORR_EN_RST 0x0
#define BLE_DEEP_SLEEP_ON_RST 0x0
#define BLE_RADIO_SLEEP_EN_RST 0x0
#define BLE_OSC_SLEEP_EN_RST 0x0

__INLINE void ble_deepslcntl_pack(uint8_t extwkupdsb, uint8_t softwakeupreq,
                                  uint8_t deepsleepcorren, uint8_t deepsleepon,
                                  uint8_t radiosleepen, uint8_t oscsleepen) {
  ASSERT_ERR((((uint32_t)extwkupdsb << 31) & ~((uint32_t)0x80000000)) == 0);
  ASSERT_ERR((((uint32_t)softwakeupreq << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)deepsleepcorren << 3) & ~((uint32_t)0x00000008)) == 0);
  ASSERT_ERR((((uint32_t)deepsleepon << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)radiosleepen << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)oscsleepen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             ((uint32_t)extwkupdsb << 31) | ((uint32_t)softwakeupreq << 4) |
                 ((uint32_t)deepsleepcorren << 3) |
                 ((uint32_t)deepsleepon << 2) | ((uint32_t)radiosleepen << 1) |
                 ((uint32_t)oscsleepen << 0));
}

__INLINE void ble_deepslcntl_unpack(uint8_t* extwkupdsb, uint8_t* deepsleepstat,
                                    uint8_t* softwakeupreq,
                                    uint8_t* deepsleepcorren,
                                    uint8_t* deepsleepon, uint8_t* radiosleepen,
                                    uint8_t* oscsleepen) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);

  *extwkupdsb = (localVal & ((uint32_t)0x80000000)) >> 31;
  *deepsleepstat = (localVal & ((uint32_t)0x00008000)) >> 15;
  *softwakeupreq = (localVal & ((uint32_t)0x00000010)) >> 4;
  *deepsleepcorren = (localVal & ((uint32_t)0x00000008)) >> 3;
  *deepsleepon = (localVal & ((uint32_t)0x00000004)) >> 2;
  *radiosleepen = (localVal & ((uint32_t)0x00000002)) >> 1;
  *oscsleepen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_extwkupdsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void ble_extwkupdsb_setf(uint8_t extwkupdsb) {
  ASSERT_ERR((((uint32_t)extwkupdsb << 31) & ~((uint32_t)0x80000000)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x80000000)) |
                 ((uint32_t)extwkupdsb << 31));
}

__INLINE uint8_t ble_deep_sleep_stat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE uint8_t ble_soft_wakeup_req_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_soft_wakeup_req_setf(uint8_t softwakeupreq) {
  ASSERT_ERR((((uint32_t)softwakeupreq << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)softwakeupreq << 4));
}

__INLINE uint8_t ble_deep_sleep_corr_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_deep_sleep_corr_en_setf(uint8_t deepsleepcorren) {
  ASSERT_ERR((((uint32_t)deepsleepcorren << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x00000008)) |
                 ((uint32_t)deepsleepcorren << 3));
}

__INLINE uint8_t ble_deep_sleep_on_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_deep_sleep_on_setf(uint8_t deepsleepon) {
  ASSERT_ERR((((uint32_t)deepsleepon << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)deepsleepon << 2));
}

__INLINE uint8_t ble_radio_sleep_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_radio_sleep_en_setf(uint8_t radiosleepen) {
  ASSERT_ERR((((uint32_t)radiosleepen << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)radiosleepen << 1));
}

__INLINE uint8_t ble_osc_sleep_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_osc_sleep_en_setf(uint8_t oscsleepen) {
  ASSERT_ERR((((uint32_t)oscsleepen << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_DEEPSLCNTL_ADDR,
             (REG_BLE_RD(BLE_DEEPSLCNTL_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)oscsleepen << 0));
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_SUPPORT
/**
 * @brief DEEPSLWKUP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           DEEPSLTIME   0x0
 * </pre>
 */
#define BLE_DEEPSLWKUP_ADDR 0x40000034
#define BLE_DEEPSLWKUP_OFFSET 0x00000034
#define BLE_DEEPSLWKUP_INDEX 0x0000000D
#define BLE_DEEPSLWKUP_RESET 0x00000000

__INLINE uint32_t ble_deepslwkup_get(void) {
  return REG_BLE_RD(BLE_DEEPSLWKUP_ADDR);
}

