kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_deepslwkup_set(uint32_t value) {
  REG_BLE_WR(BLE_DEEPSLWKUP_ADDR, value);
}

// field definitions
#define BLE_DEEPSLTIME_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_DEEPSLTIME_LSB 0
#define BLE_DEEPSLTIME_WIDTH ((uint32_t)0x00000020)

#define BLE_DEEPSLTIME_RST 0x0

__INLINE uint32_t ble_deepsltime_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLWKUP_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_deepsltime_setf(uint32_t deepsltime) {
  ASSERT_ERR((((uint32_t)deepsltime << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_DEEPSLWKUP_ADDR, (uint32_t)deepsltime << 0);
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_SUPPORT
/**
 * @brief DEEPSLSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00            DEEPSLDUR   0x0
 * </pre>
 */
#define BLE_DEEPSLSTAT_ADDR 0x40000038
#define BLE_DEEPSLSTAT_OFFSET 0x00000038
#define BLE_DEEPSLSTAT_INDEX 0x0000000E
#define BLE_DEEPSLSTAT_RESET 0x00000000

__INLINE uint32_t ble_deepslstat_get(void) {
  return REG_BLE_RD(BLE_DEEPSLSTAT_ADDR);
}

// field definitions
#define BLE_DEEPSLDUR_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_DEEPSLDUR_LSB 0
#define BLE_DEEPSLDUR_WIDTH ((uint32_t)0x00000020)

#define BLE_DEEPSLDUR_RST 0x0

__INLINE uint32_t ble_deepsldur_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEEPSLSTAT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_SUPPORT
/**
 * @brief ENBPRESET register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:21                TWEXT   0x0
 *  20:10                TWOSC   0x0
 *  09:00                 TWRM   0x0
 * </pre>
 */
#define BLE_ENBPRESET_ADDR 0x4000003C
#define BLE_ENBPRESET_OFFSET 0x0000003C
#define BLE_ENBPRESET_INDEX 0x0000000F
#define BLE_ENBPRESET_RESET 0x00000000

__INLINE uint32_t ble_enbpreset_get(void) {
  return REG_BLE_RD(BLE_ENBPRESET_ADDR);
}

__INLINE void ble_enbpreset_set(uint32_t value) {
  REG_BLE_WR(BLE_ENBPRESET_ADDR, value);
}

// field definitions
#define BLE_TWEXT_MASK ((uint32_t)0xFFE00000)
#define BLE_TWEXT_LSB 21
#define BLE_TWEXT_WIDTH ((uint32_t)0x0000000B)
#define BLE_TWOSC_MASK ((uint32_t)0x001FFC00)
#define BLE_TWOSC_LSB 10
#define BLE_TWOSC_WIDTH ((uint32_t)0x0000000B)
#define BLE_TWRM_MASK ((uint32_t)0x000003FF)
#define BLE_TWRM_LSB 0
#define BLE_TWRM_WIDTH ((uint32_t)0x0000000A)

#define BLE_TWEXT_RST 0x0
#define BLE_TWOSC_RST 0x0
#define BLE_TWRM_RST 0x0

__INLINE void ble_enbpreset_pack(uint16_t twext, uint16_t twosc,
                                 uint16_t twrm) {
  ASSERT_ERR((((uint32_t)twext << 21) & ~((uint32_t)0xFFE00000)) == 0);
  ASSERT_ERR((((uint32_t)twosc << 10) & ~((uint32_t)0x001FFC00)) == 0);
  ASSERT_ERR((((uint32_t)twrm << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_BLE_WR(BLE_ENBPRESET_ADDR, ((uint32_t)twext << 21) |
                                     ((uint32_t)twosc << 10) |
                                     ((uint32_t)twrm << 0));
}

__INLINE void ble_enbpreset_unpack(uint16_t* twext, uint16_t* twosc,
                                   uint16_t* twrm) {
  uint32_t localVal = REG_BLE_RD(BLE_ENBPRESET_ADDR);

  *twext = (localVal & ((uint32_t)0xFFE00000)) >> 21;
  *twosc = (localVal & ((uint32_t)0x001FFC00)) >> 10;
  *twrm = (localVal & ((uint32_t)0x000003FF)) >> 0;
}

__INLINE uint16_t ble_twext_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ENBPRESET_ADDR);
  return ((localVal & ((uint32_t)0xFFE00000)) >> 21);
}

__INLINE void ble_twext_setf(uint16_t twext) {
  ASSERT_ERR((((uint32_t)twext << 21) & ~((uint32_t)0xFFE00000)) == 0);
  REG_BLE_WR(BLE_ENBPRESET_ADDR,
             (REG_BLE_RD(BLE_ENBPRESET_ADDR) & ~((uint32_t)0xFFE00000)) |
                 ((uint32_t)twext << 21));
}

__INLINE uint16_t ble_twosc_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ENBPRESET_ADDR);
  return ((localVal & ((uint32_t)0x001FFC00)) >> 10);
}

__INLINE void ble_twosc_setf(uint16_t twosc) {
  ASSERT_ERR((((uint32_t)twosc << 10) & ~((uint32_t)0x001FFC00)) == 0);
  REG_BLE_WR(BLE_ENBPRESET_ADDR,
             (REG_BLE_RD(BLE_ENBPRESET_ADDR) & ~((uint32_t)0x001FFC00)) |
                 ((uint32_t)twosc << 10));
}

__INLINE uint16_t ble_twrm_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ENBPRESET_ADDR);
  return ((localVal & ((uint32_t)0x000003FF)) >> 0);
}

__INLINE void ble_twrm_setf(uint16_t twrm) {
  ASSERT_ERR((((uint32_t)twrm << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_BLE_WR(BLE_ENBPRESET_ADDR,
             (REG_BLE_RD(BLE_ENBPRESET_ADDR) & ~((uint32_t)0x000003FF)) |
                 ((uint32_t)twrm << 0));
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_SUPPORT
/**
 * @brief FINECNTCORR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00          FINECNTCORR   0x0
 * </pre>
 */
#define BLE_FINECNTCORR_ADDR 0x40000040
#define BLE_FINECNTCORR_OFFSET 0x00000040
#define BLE_FINECNTCORR_INDEX 0x00000010
#define BLE_FINECNTCORR_RESET 0x00000000

__INLINE uint32_t ble_finecntcorr_get(void) {
  return REG_BLE_RD(BLE_FINECNTCORR_ADDR);
}

__INLINE void ble_finecntcorr_set(uint32_t value) {
  REG_BLE_WR(BLE_FINECNTCORR_ADDR, value);
}

// field definitions
#define BLE_FINECNTCORR_MASK ((uint32_t)0x000003FF)
#define BLE_FINECNTCORR_LSB 0
#define BLE_FINECNTCORR_WIDTH ((uint32_t)0x0000000A)

#define BLE_FINECNTCORR_RST 0x0

__INLINE uint16_t ble_finecntcorr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_FINECNTCORR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000003FF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_finecntcorr_setf(uint16_t finecntcorr) {
  ASSERT_ERR((((uint32_t)finecntcorr << 0) & ~((uint32_t)0x000003FF)) == 0);
  REG_BLE_WR(BLE_FINECNTCORR_ADDR, (uint32_t)finecntcorr << 0);
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_SUPPORT
/**
 * @brief BASETIMECNTCORR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  26:00      BASETIMECNTCORR   0x0
 * </pre>
 */
#define BLE_BASETIMECNTCORR_ADDR 0x40000044
#define BLE_BASETIMECNTCORR_OFFSET 0x00000044
#define BLE_BASETIMECNTCORR_INDEX 0x00000011
#define BLE_BASETIMECNTCORR_RESET 0x00000000

