kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint32_t ble_basetimecntcorr_get(void) {
  return REG_BLE_RD(BLE_BASETIMECNTCORR_ADDR);
}

__INLINE void ble_basetimecntcorr_set(uint32_t value) {
  REG_BLE_WR(BLE_BASETIMECNTCORR_ADDR, value);
}

// field definitions
#define BLE_BASETIMECNTCORR_MASK ((uint32_t)0x07FFFFFF)
#define BLE_BASETIMECNTCORR_LSB 0
#define BLE_BASETIMECNTCORR_WIDTH ((uint32_t)0x0000001B)

#define BLE_BASETIMECNTCORR_RST 0x0

__INLINE uint32_t ble_basetimecntcorr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BASETIMECNTCORR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x07FFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_basetimecntcorr_setf(uint32_t basetimecntcorr) {
  ASSERT_ERR((((uint32_t)basetimecntcorr << 0) & ~((uint32_t)0x07FFFFFF)) == 0);
  REG_BLE_WR(BLE_BASETIMECNTCORR_ADDR, (uint32_t)basetimecntcorr << 0);
}

#endif  // RW_BLE_SUPPORT
/**
 * @brief DIAGCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31             DIAG3_EN   0
 *  29:24                DIAG3   0x0
 *     23             DIAG2_EN   0
 *  21:16                DIAG2   0x0
 *     15             DIAG1_EN   0
 *  13:08                DIAG1   0x0
 *     07             DIAG0_EN   0
 *  05:00                DIAG0   0x0
 * </pre>
 */
#define BLE_DIAGCNTL_ADDR 0x40000050
#define BLE_DIAGCNTL_OFFSET 0x00000050
#define BLE_DIAGCNTL_INDEX 0x00000014
#define BLE_DIAGCNTL_RESET 0x00000000

__INLINE uint32_t ble_diagcntl_get(void) {
  return REG_BLE_RD(BLE_DIAGCNTL_ADDR);
}

__INLINE void ble_diagcntl_set(uint32_t value) {
  REG_BLE_WR(BLE_DIAGCNTL_ADDR, value);
}

// field definitions
#define BLE_DIAG3_EN_BIT ((uint32_t)0x80000000)
#define BLE_DIAG3_EN_POS 31
#define BLE_DIAG3_MASK ((uint32_t)0x3F000000)
#define BLE_DIAG3_LSB 24
#define BLE_DIAG3_WIDTH ((uint32_t)0x00000006)
#define BLE_DIAG2_EN_BIT ((uint32_t)0x00800000)
#define BLE_DIAG2_EN_POS 23
#define BLE_DIAG2_MASK ((uint32_t)0x003F0000)
#define BLE_DIAG2_LSB 16
#define BLE_DIAG2_WIDTH ((uint32_t)0x00000006)
#define BLE_DIAG1_EN_BIT ((uint32_t)0x00008000)
#define BLE_DIAG1_EN_POS 15
#define BLE_DIAG1_MASK ((uint32_t)0x00003F00)
#define BLE_DIAG1_LSB 8
#define BLE_DIAG1_WIDTH ((uint32_t)0x00000006)
#define BLE_DIAG0_EN_BIT ((uint32_t)0x00000080)
#define BLE_DIAG0_EN_POS 7
#define BLE_DIAG0_MASK ((uint32_t)0x0000003F)
#define BLE_DIAG0_LSB 0
#define BLE_DIAG0_WIDTH ((uint32_t)0x00000006)

#define BLE_DIAG3_EN_RST 0x0
#define BLE_DIAG3_RST 0x0
#define BLE_DIAG2_EN_RST 0x0
#define BLE_DIAG2_RST 0x0
#define BLE_DIAG1_EN_RST 0x0
#define BLE_DIAG1_RST 0x0
#define BLE_DIAG0_EN_RST 0x0
#define BLE_DIAG0_RST 0x0

__INLINE void ble_diagcntl_pack(uint8_t diag3en, uint8_t diag3, uint8_t diag2en,
                                uint8_t diag2, uint8_t diag1en, uint8_t diag1,
                                uint8_t diag0en, uint8_t diag0) {
  ASSERT_ERR((((uint32_t)diag3en << 31) & ~((uint32_t)0x80000000)) == 0);
  ASSERT_ERR((((uint32_t)diag3 << 24) & ~((uint32_t)0x3F000000)) == 0);
  ASSERT_ERR((((uint32_t)diag2en << 23) & ~((uint32_t)0x00800000)) == 0);
  ASSERT_ERR((((uint32_t)diag2 << 16) & ~((uint32_t)0x003F0000)) == 0);
  ASSERT_ERR((((uint32_t)diag1en << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)diag1 << 8) & ~((uint32_t)0x00003F00)) == 0);
  ASSERT_ERR((((uint32_t)diag0en << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)diag0 << 0) & ~((uint32_t)0x0000003F)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             ((uint32_t)diag3en << 31) | ((uint32_t)diag3 << 24) |
                 ((uint32_t)diag2en << 23) | ((uint32_t)diag2 << 16) |
                 ((uint32_t)diag1en << 15) | ((uint32_t)diag1 << 8) |
                 ((uint32_t)diag0en << 7) | ((uint32_t)diag0 << 0));
}

__INLINE void ble_diagcntl_unpack(uint8_t* diag3en, uint8_t* diag3,
                                  uint8_t* diag2en, uint8_t* diag2,
                                  uint8_t* diag1en, uint8_t* diag1,
                                  uint8_t* diag0en, uint8_t* diag0) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);

  *diag3en = (localVal & ((uint32_t)0x80000000)) >> 31;
  *diag3 = (localVal & ((uint32_t)0x3F000000)) >> 24;
  *diag2en = (localVal & ((uint32_t)0x00800000)) >> 23;
  *diag2 = (localVal & ((uint32_t)0x003F0000)) >> 16;
  *diag1en = (localVal & ((uint32_t)0x00008000)) >> 15;
  *diag1 = (localVal & ((uint32_t)0x00003F00)) >> 8;
  *diag0en = (localVal & ((uint32_t)0x00000080)) >> 7;
  *diag0 = (localVal & ((uint32_t)0x0000003F)) >> 0;
}

__INLINE uint8_t ble_diag3_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void ble_diag3_en_setf(uint8_t diag3en) {
  ASSERT_ERR((((uint32_t)diag3en << 31) & ~((uint32_t)0x80000000)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x80000000)) |
                 ((uint32_t)diag3en << 31));
}

__INLINE uint8_t ble_diag3_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

__INLINE void ble_diag3_setf(uint8_t diag3) {
  ASSERT_ERR((((uint32_t)diag3 << 24) & ~((uint32_t)0x3F000000)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x3F000000)) |
                 ((uint32_t)diag3 << 24));
}

__INLINE uint8_t ble_diag2_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__INLINE void ble_diag2_en_setf(uint8_t diag2en) {
  ASSERT_ERR((((uint32_t)diag2en << 23) & ~((uint32_t)0x00800000)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x00800000)) |
                 ((uint32_t)diag2en << 23));
}

__INLINE uint8_t ble_diag2_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x003F0000)) >> 16);
}

__INLINE void ble_diag2_setf(uint8_t diag2) {
  ASSERT_ERR((((uint32_t)diag2 << 16) & ~((uint32_t)0x003F0000)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x003F0000)) |
                 ((uint32_t)diag2 << 16));
}

__INLINE uint8_t ble_diag1_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_diag1_en_setf(uint8_t diag1en) {
  ASSERT_ERR((((uint32_t)diag1en << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)diag1en << 15));
}

__INLINE uint8_t ble_diag1_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

__INLINE void ble_diag1_setf(uint8_t diag1) {
  ASSERT_ERR((((uint32_t)diag1 << 8) & ~((uint32_t)0x00003F00)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x00003F00)) |
                 ((uint32_t)diag1 << 8));
}

__INLINE uint8_t ble_diag0_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_diag0_en_setf(uint8_t diag0en) {
  ASSERT_ERR((((uint32_t)diag0en << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)diag0en << 7));
}

__INLINE uint8_t ble_diag0_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGCNTL_ADDR);
  return ((localVal & ((uint32_t)0x0000003F)) >> 0);
}

