kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_diag0_setf(uint8_t diag0) {
  ASSERT_ERR((((uint32_t)diag0 << 0) & ~((uint32_t)0x0000003F)) == 0);
  REG_BLE_WR(BLE_DIAGCNTL_ADDR,
             (REG_BLE_RD(BLE_DIAGCNTL_ADDR) & ~((uint32_t)0x0000003F)) |
                 ((uint32_t)diag0 << 0));
}

/**
 * @brief DIAGSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24            DIAG3STAT   0x0
 *  23:16            DIAG2STAT   0x0
 *  15:08            DIAG1STAT   0x0
 *  07:00            DIAG0STAT   0x0
 * </pre>
 */
#define BLE_DIAGSTAT_ADDR 0x40000054
#define BLE_DIAGSTAT_OFFSET 0x00000054
#define BLE_DIAGSTAT_INDEX 0x00000015
#define BLE_DIAGSTAT_RESET 0x00000000

__INLINE uint32_t ble_diagstat_get(void) {
  return REG_BLE_RD(BLE_DIAGSTAT_ADDR);
}

// field definitions
#define BLE_DIAG3STAT_MASK ((uint32_t)0xFF000000)
#define BLE_DIAG3STAT_LSB 24
#define BLE_DIAG3STAT_WIDTH ((uint32_t)0x00000008)
#define BLE_DIAG2STAT_MASK ((uint32_t)0x00FF0000)
#define BLE_DIAG2STAT_LSB 16
#define BLE_DIAG2STAT_WIDTH ((uint32_t)0x00000008)
#define BLE_DIAG1STAT_MASK ((uint32_t)0x0000FF00)
#define BLE_DIAG1STAT_LSB 8
#define BLE_DIAG1STAT_WIDTH ((uint32_t)0x00000008)
#define BLE_DIAG0STAT_MASK ((uint32_t)0x000000FF)
#define BLE_DIAG0STAT_LSB 0
#define BLE_DIAG0STAT_WIDTH ((uint32_t)0x00000008)

#define BLE_DIAG3STAT_RST 0x0
#define BLE_DIAG2STAT_RST 0x0
#define BLE_DIAG1STAT_RST 0x0
#define BLE_DIAG0STAT_RST 0x0

__INLINE void ble_diagstat_unpack(uint8_t* diag3stat, uint8_t* diag2stat,
                                  uint8_t* diag1stat, uint8_t* diag0stat) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGSTAT_ADDR);

  *diag3stat = (localVal & ((uint32_t)0xFF000000)) >> 24;
  *diag2stat = (localVal & ((uint32_t)0x00FF0000)) >> 16;
  *diag1stat = (localVal & ((uint32_t)0x0000FF00)) >> 8;
  *diag0stat = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_diag3stat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGSTAT_ADDR);
  return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE uint8_t ble_diag2stat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGSTAT_ADDR);
  return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE uint8_t ble_diag1stat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGSTAT_ADDR);
  return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE uint8_t ble_diag0stat_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DIAGSTAT_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief DEBUGADDMAX register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00               ADDMAX   0x0
 * </pre>
 */
#define BLE_DEBUGADDMAX_ADDR 0x40000058
#define BLE_DEBUGADDMAX_OFFSET 0x00000058
#define BLE_DEBUGADDMAX_INDEX 0x00000016
#define BLE_DEBUGADDMAX_RESET 0x00000000

__INLINE uint32_t ble_debugaddmax_get(void) {
  return REG_BLE_RD(BLE_DEBUGADDMAX_ADDR);
}

__INLINE void ble_debugaddmax_set(uint32_t value) {
  REG_BLE_WR(BLE_DEBUGADDMAX_ADDR, value);
}

// field definitions
#define BLE_ADDMAX_MASK ((uint32_t)0x0000FFFF)
#define BLE_ADDMAX_LSB 0
#define BLE_ADDMAX_WIDTH ((uint32_t)0x00000010)

#define BLE_ADDMAX_RST 0x0

__INLINE uint16_t ble_addmax_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEBUGADDMAX_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_addmax_setf(uint16_t addmax) {
  ASSERT_ERR((((uint32_t)addmax << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_DEBUGADDMAX_ADDR, (uint32_t)addmax << 0);
}

/**
 * @brief DEBUGADDMIN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00               ADDMIN   0x0
 * </pre>
 */
#define BLE_DEBUGADDMIN_ADDR 0x4000005C
#define BLE_DEBUGADDMIN_OFFSET 0x0000005C
#define BLE_DEBUGADDMIN_INDEX 0x00000017
#define BLE_DEBUGADDMIN_RESET 0x00000000

__INLINE uint32_t ble_debugaddmin_get(void) {
  return REG_BLE_RD(BLE_DEBUGADDMIN_ADDR);
}

__INLINE void ble_debugaddmin_set(uint32_t value) {
  REG_BLE_WR(BLE_DEBUGADDMIN_ADDR, value);
}

// field definitions
#define BLE_ADDMIN_MASK ((uint32_t)0x0000FFFF)
#define BLE_ADDMIN_LSB 0
#define BLE_ADDMIN_WIDTH ((uint32_t)0x00000010)

#define BLE_ADDMIN_RST 0x0

__INLINE uint16_t ble_addmin_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_DEBUGADDMIN_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_addmin_setf(uint16_t addmin) {
  ASSERT_ERR((((uint32_t)addmin << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_DEBUGADDMIN_ADDR, (uint32_t)addmin << 0);
}

/**
 * @brief ERRORTYPESTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     11       CSFORMAT_ERROR   0
 *     10        CSTXPTR_ERROR   0
 *     08    RADIO_EMACC_ERROR   0
 *     07        LLCHMAP_ERROR   0
 *     06         IFS_UNDERRUN   0
 *     05        RXCRYPT_ERROR   0
 *     04      WHITELIST_ERROR   0
 *     03           APFM_ERROR   0
 *     02         TXDESC_ERROR   0
 *     01   PKTCNTL_EMACC_ERROR   0
 *     00        TXCRYPT_ERROR   0
 * </pre>
 */
#define BLE_ERRORTYPESTAT_ADDR 0x40000060
#define BLE_ERRORTYPESTAT_OFFSET 0x00000060
#define BLE_ERRORTYPESTAT_INDEX 0x00000018
#define BLE_ERRORTYPESTAT_RESET 0x00000000

__INLINE uint32_t ble_errortypestat_get(void) {
  return REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
}

// field definitions
#define BLE_CSFORMAT_ERROR_BIT ((uint32_t)0x00000800)
#define BLE_CSFORMAT_ERROR_POS 11
#define BLE_CSTXPTR_ERROR_BIT ((uint32_t)0x00000400)
#define BLE_CSTXPTR_ERROR_POS 10
#define BLE_RADIO_EMACC_ERROR_BIT ((uint32_t)0x00000100)
#define BLE_RADIO_EMACC_ERROR_POS 8
#define BLE_LLCHMAP_ERROR_BIT ((uint32_t)0x00000080)
#define BLE_LLCHMAP_ERROR_POS 7
#define BLE_IFS_UNDERRUN_BIT ((uint32_t)0x00000040)
#define BLE_IFS_UNDERRUN_POS 6
#define BLE_RXCRYPT_ERROR_BIT ((uint32_t)0x00000020)
#define BLE_RXCRYPT_ERROR_POS 5
#define BLE_WHITELIST_ERROR_BIT ((uint32_t)0x00000010)
#define BLE_WHITELIST_ERROR_POS 4
#define BLE_APFM_ERROR_BIT ((uint32_t)0x00000008)
#define BLE_APFM_ERROR_POS 3
#define BLE_TXDESC_ERROR_BIT ((uint32_t)0x00000004)
#define BLE_TXDESC_ERROR_POS 2
#define BLE_PKTCNTL_EMACC_ERROR_BIT ((uint32_t)0x00000002)
#define BLE_PKTCNTL_EMACC_ERROR_POS 1
#define BLE_TXCRYPT_ERROR_BIT ((uint32_t)0x00000001)
#define BLE_TXCRYPT_ERROR_POS 0

#define BLE_CSFORMAT_ERROR_RST 0x0
#define BLE_CSTXPTR_ERROR_RST 0x0
#define BLE_RADIO_EMACC_ERROR_RST 0x0
#define BLE_LLCHMAP_ERROR_RST 0x0
#define BLE_IFS_UNDERRUN_RST 0x0
#define BLE_RXCRYPT_ERROR_RST 0x0
#define BLE_WHITELIST_ERROR_RST 0x0
#define BLE_APFM_ERROR_RST 0x0
#define BLE_TXDESC_ERROR_RST 0x0
#define BLE_PKTCNTL_EMACC_ERROR_RST 0x0
#define BLE_TXCRYPT_ERROR_RST 0x0

__INLINE void ble_errortypestat_unpack(
    uint8_t* csformaterror, uint8_t* cstxptrerror, uint8_t* radioemaccerror,
    uint8_t* llchmaperror, uint8_t* ifsunderrun, uint8_t* rxcrypterror,
    uint8_t* whitelisterror, uint8_t* apfmerror, uint8_t* txdescerror,
    uint8_t* pktcntlemaccerror, uint8_t* txcrypterror) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);

  *csformaterror = (localVal & ((uint32_t)0x00000800)) >> 11;
  *cstxptrerror = (localVal & ((uint32_t)0x00000400)) >> 10;
  *radioemaccerror = (localVal & ((uint32_t)0x00000100)) >> 8;
  *llchmaperror = (localVal & ((uint32_t)0x00000080)) >> 7;
  *ifsunderrun = (localVal & ((uint32_t)0x00000040)) >> 6;
  *rxcrypterror = (localVal & ((uint32_t)0x00000020)) >> 5;
  *whitelisterror = (localVal & ((uint32_t)0x00000010)) >> 4;
  *apfmerror = (localVal & ((uint32_t)0x00000008)) >> 3;
  *txdescerror = (localVal & ((uint32_t)0x00000004)) >> 2;
  *pktcntlemaccerror = (localVal & ((uint32_t)0x00000002)) >> 1;
  *txcrypterror = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_csformat_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE uint8_t ble_cstxptr_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE uint8_t ble_radio_emacc_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

