kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_llchmap_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE uint8_t ble_ifs_underrun_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE uint8_t ble_rxcrypt_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE uint8_t ble_whitelist_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE uint8_t ble_apfm_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE uint8_t ble_txdesc_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE uint8_t ble_pktcntl_emacc_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_txcrypt_error_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ERRORTYPESTAT_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief SWPROFILING register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31             SWPROF31   0
 *     30             SWPROF30   0
 *     29             SWPROF29   0
 *     28             SWPROF28   0
 *     27             SWPROF27   0
 *     26             SWPROF26   0
 *     25             SWPROF25   0
 *     24             SWPROF24   0
 *     23             SWPROF23   0
 *     22             SWPROF22   0
 *     21             SWPROF21   0
 *     20             SWPROF20   0
 *     19             SWPROF19   0
 *     18             SWPROF18   0
 *     17             SWPROF17   0
 *     16             SWPROF16   0
 *     15             SWPROF15   0
 *     14             SWPROF14   0
 *     13             SWPROF13   0
 *     12             SWPROF12   0
 *     11             SWPROF11   0
 *     10             SWPROF10   0
 *     09              SWPROF9   0
 *     08              SWPROF8   0
 *     07              SWPROF7   0
 *     06              SWPROF6   0
 *     05              SWPROF5   0
 *     04              SWPROF4   0
 *     03              SWPROF3   0
 *     02              SWPROF2   0
 *     01              SWPROF1   0
 *     00              SWPROF0   0
 * </pre>
 */
#define BLE_SWPROFILING_ADDR 0x40000064
#define BLE_SWPROFILING_OFFSET 0x00000064
#define BLE_SWPROFILING_INDEX 0x00000019
#define BLE_SWPROFILING_RESET 0x00000000

__INLINE uint32_t ble_swprofiling_get(void) {
  return REG_BLE_RD(BLE_SWPROFILING_ADDR);
}

__INLINE void ble_swprofiling_set(uint32_t value) {
  REG_BLE_WR(BLE_SWPROFILING_ADDR, value);
}

// field definitions
#define BLE_SWPROF31_BIT ((uint32_t)0x80000000)
#define BLE_SWPROF31_POS 31
#define BLE_SWPROF30_BIT ((uint32_t)0x40000000)
#define BLE_SWPROF30_POS 30
#define BLE_SWPROF29_BIT ((uint32_t)0x20000000)
#define BLE_SWPROF29_POS 29
#define BLE_SWPROF28_BIT ((uint32_t)0x10000000)
#define BLE_SWPROF28_POS 28
#define BLE_SWPROF27_BIT ((uint32_t)0x08000000)
#define BLE_SWPROF27_POS 27
#define BLE_SWPROF26_BIT ((uint32_t)0x04000000)
#define BLE_SWPROF26_POS 26
#define BLE_SWPROF25_BIT ((uint32_t)0x02000000)
#define BLE_SWPROF25_POS 25
#define BLE_SWPROF24_BIT ((uint32_t)0x01000000)
#define BLE_SWPROF24_POS 24
#define BLE_SWPROF23_BIT ((uint32_t)0x00800000)
#define BLE_SWPROF23_POS 23
#define BLE_SWPROF22_BIT ((uint32_t)0x00400000)
#define BLE_SWPROF22_POS 22
#define BLE_SWPROF21_BIT ((uint32_t)0x00200000)
#define BLE_SWPROF21_POS 21
#define BLE_SWPROF20_BIT ((uint32_t)0x00100000)
#define BLE_SWPROF20_POS 20
#define BLE_SWPROF19_BIT ((uint32_t)0x00080000)
#define BLE_SWPROF19_POS 19
#define BLE_SWPROF18_BIT ((uint32_t)0x00040000)
#define BLE_SWPROF18_POS 18
#define BLE_SWPROF17_BIT ((uint32_t)0x00020000)
#define BLE_SWPROF17_POS 17
#define BLE_SWPROF16_BIT ((uint32_t)0x00010000)
#define BLE_SWPROF16_POS 16
#define BLE_SWPROF15_BIT ((uint32_t)0x00008000)
#define BLE_SWPROF15_POS 15
#define BLE_SWPROF14_BIT ((uint32_t)0x00004000)
#define BLE_SWPROF14_POS 14
#define BLE_SWPROF13_BIT ((uint32_t)0x00002000)
#define BLE_SWPROF13_POS 13
#define BLE_SWPROF12_BIT ((uint32_t)0x00001000)
#define BLE_SWPROF12_POS 12
#define BLE_SWPROF11_BIT ((uint32_t)0x00000800)
#define BLE_SWPROF11_POS 11
#define BLE_SWPROF10_BIT ((uint32_t)0x00000400)
#define BLE_SWPROF10_POS 10
#define BLE_SWPROF9_BIT ((uint32_t)0x00000200)
#define BLE_SWPROF9_POS 9
#define BLE_SWPROF8_BIT ((uint32_t)0x00000100)
#define BLE_SWPROF8_POS 8
#define BLE_SWPROF7_BIT ((uint32_t)0x00000080)
#define BLE_SWPROF7_POS 7
#define BLE_SWPROF6_BIT ((uint32_t)0x00000040)
#define BLE_SWPROF6_POS 6
#define BLE_SWPROF5_BIT ((uint32_t)0x00000020)
#define BLE_SWPROF5_POS 5
#define BLE_SWPROF4_BIT ((uint32_t)0x00000010)
#define BLE_SWPROF4_POS 4
#define BLE_SWPROF3_BIT ((uint32_t)0x00000008)
#define BLE_SWPROF3_POS 3
#define BLE_SWPROF2_BIT ((uint32_t)0x00000004)
#define BLE_SWPROF2_POS 2
#define BLE_SWPROF1_BIT ((uint32_t)0x00000002)
#define BLE_SWPROF1_POS 1
#define BLE_SWPROF0_BIT ((uint32_t)0x00000001)
#define BLE_SWPROF0_POS 0

#define BLE_SWPROF31_RST 0x0
#define BLE_SWPROF30_RST 0x0
#define BLE_SWPROF29_RST 0x0
#define BLE_SWPROF28_RST 0x0
#define BLE_SWPROF27_RST 0x0
#define BLE_SWPROF26_RST 0x0
#define BLE_SWPROF25_RST 0x0
#define BLE_SWPROF24_RST 0x0
#define BLE_SWPROF23_RST 0x0
#define BLE_SWPROF22_RST 0x0
#define BLE_SWPROF21_RST 0x0
#define BLE_SWPROF20_RST 0x0
#define BLE_SWPROF19_RST 0x0
#define BLE_SWPROF18_RST 0x0
#define BLE_SWPROF17_RST 0x0
#define BLE_SWPROF16_RST 0x0
#define BLE_SWPROF15_RST 0x0
#define BLE_SWPROF14_RST 0x0
#define BLE_SWPROF13_RST 0x0
#define BLE_SWPROF12_RST 0x0
#define BLE_SWPROF11_RST 0x0
#define BLE_SWPROF10_RST 0x0
#define BLE_SWPROF9_RST 0x0
#define BLE_SWPROF8_RST 0x0
#define BLE_SWPROF7_RST 0x0
#define BLE_SWPROF6_RST 0x0
#define BLE_SWPROF5_RST 0x0
#define BLE_SWPROF4_RST 0x0
#define BLE_SWPROF3_RST 0x0
#define BLE_SWPROF2_RST 0x0
#define BLE_SWPROF1_RST 0x0
#define BLE_SWPROF0_RST 0x0

