kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_swprofiling_pack(
    uint8_t swprof31, uint8_t swprof30, uint8_t swprof29, uint8_t swprof28,
    uint8_t swprof27, uint8_t swprof26, uint8_t swprof25, uint8_t swprof24,
    uint8_t swprof23, uint8_t swprof22, uint8_t swprof21, uint8_t swprof20,
    uint8_t swprof19, uint8_t swprof18, uint8_t swprof17, uint8_t swprof16,
    uint8_t swprof15, uint8_t swprof14, uint8_t swprof13, uint8_t swprof12,
    uint8_t swprof11, uint8_t swprof10, uint8_t swprof9, uint8_t swprof8,
    uint8_t swprof7, uint8_t swprof6, uint8_t swprof5, uint8_t swprof4,
    uint8_t swprof3, uint8_t swprof2, uint8_t swprof1, uint8_t swprof0) {
  ASSERT_ERR((((uint32_t)swprof31 << 31) & ~((uint32_t)0x80000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof30 << 30) & ~((uint32_t)0x40000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof29 << 29) & ~((uint32_t)0x20000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof28 << 28) & ~((uint32_t)0x10000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof27 << 27) & ~((uint32_t)0x08000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof26 << 26) & ~((uint32_t)0x04000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof25 << 25) & ~((uint32_t)0x02000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof24 << 24) & ~((uint32_t)0x01000000)) == 0);
  ASSERT_ERR((((uint32_t)swprof23 << 23) & ~((uint32_t)0x00800000)) == 0);
  ASSERT_ERR((((uint32_t)swprof22 << 22) & ~((uint32_t)0x00400000)) == 0);
  ASSERT_ERR((((uint32_t)swprof21 << 21) & ~((uint32_t)0x00200000)) == 0);
  ASSERT_ERR((((uint32_t)swprof20 << 20) & ~((uint32_t)0x00100000)) == 0);
  ASSERT_ERR((((uint32_t)swprof19 << 19) & ~((uint32_t)0x00080000)) == 0);
  ASSERT_ERR((((uint32_t)swprof18 << 18) & ~((uint32_t)0x00040000)) == 0);
  ASSERT_ERR((((uint32_t)swprof17 << 17) & ~((uint32_t)0x00020000)) == 0);
  ASSERT_ERR((((uint32_t)swprof16 << 16) & ~((uint32_t)0x00010000)) == 0);
  ASSERT_ERR((((uint32_t)swprof15 << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)swprof14 << 14) & ~((uint32_t)0x00004000)) == 0);
  ASSERT_ERR((((uint32_t)swprof13 << 13) & ~((uint32_t)0x00002000)) == 0);
  ASSERT_ERR((((uint32_t)swprof12 << 12) & ~((uint32_t)0x00001000)) == 0);
  ASSERT_ERR((((uint32_t)swprof11 << 11) & ~((uint32_t)0x00000800)) == 0);
  ASSERT_ERR((((uint32_t)swprof10 << 10) & ~((uint32_t)0x00000400)) == 0);
  ASSERT_ERR((((uint32_t)swprof9 << 9) & ~((uint32_t)0x00000200)) == 0);
  ASSERT_ERR((((uint32_t)swprof8 << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)swprof7 << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)swprof6 << 6) & ~((uint32_t)0x00000040)) == 0);
  ASSERT_ERR((((uint32_t)swprof5 << 5) & ~((uint32_t)0x00000020)) == 0);
  ASSERT_ERR((((uint32_t)swprof4 << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)swprof3 << 3) & ~((uint32_t)0x00000008)) == 0);
  ASSERT_ERR((((uint32_t)swprof2 << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)swprof1 << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)swprof0 << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             ((uint32_t)swprof31 << 31) | ((uint32_t)swprof30 << 30) |
                 ((uint32_t)swprof29 << 29) | ((uint32_t)swprof28 << 28) |
                 ((uint32_t)swprof27 << 27) | ((uint32_t)swprof26 << 26) |
                 ((uint32_t)swprof25 << 25) | ((uint32_t)swprof24 << 24) |
                 ((uint32_t)swprof23 << 23) | ((uint32_t)swprof22 << 22) |
                 ((uint32_t)swprof21 << 21) | ((uint32_t)swprof20 << 20) |
                 ((uint32_t)swprof19 << 19) | ((uint32_t)swprof18 << 18) |
                 ((uint32_t)swprof17 << 17) | ((uint32_t)swprof16 << 16) |
                 ((uint32_t)swprof15 << 15) | ((uint32_t)swprof14 << 14) |
                 ((uint32_t)swprof13 << 13) | ((uint32_t)swprof12 << 12) |
                 ((uint32_t)swprof11 << 11) | ((uint32_t)swprof10 << 10) |
                 ((uint32_t)swprof9 << 9) | ((uint32_t)swprof8 << 8) |
                 ((uint32_t)swprof7 << 7) | ((uint32_t)swprof6 << 6) |
                 ((uint32_t)swprof5 << 5) | ((uint32_t)swprof4 << 4) |
                 ((uint32_t)swprof3 << 3) | ((uint32_t)swprof2 << 2) |
                 ((uint32_t)swprof1 << 1) | ((uint32_t)swprof0 << 0));
}

__INLINE void ble_swprofiling_unpack(
    uint8_t* swprof31, uint8_t* swprof30, uint8_t* swprof29, uint8_t* swprof28,
    uint8_t* swprof27, uint8_t* swprof26, uint8_t* swprof25, uint8_t* swprof24,
    uint8_t* swprof23, uint8_t* swprof22, uint8_t* swprof21, uint8_t* swprof20,
    uint8_t* swprof19, uint8_t* swprof18, uint8_t* swprof17, uint8_t* swprof16,
    uint8_t* swprof15, uint8_t* swprof14, uint8_t* swprof13, uint8_t* swprof12,
    uint8_t* swprof11, uint8_t* swprof10, uint8_t* swprof9, uint8_t* swprof8,
    uint8_t* swprof7, uint8_t* swprof6, uint8_t* swprof5, uint8_t* swprof4,
    uint8_t* swprof3, uint8_t* swprof2, uint8_t* swprof1, uint8_t* swprof0) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);

  *swprof31 = (localVal & ((uint32_t)0x80000000)) >> 31;
  *swprof30 = (localVal & ((uint32_t)0x40000000)) >> 30;
  *swprof29 = (localVal & ((uint32_t)0x20000000)) >> 29;
  *swprof28 = (localVal & ((uint32_t)0x10000000)) >> 28;
  *swprof27 = (localVal & ((uint32_t)0x08000000)) >> 27;
  *swprof26 = (localVal & ((uint32_t)0x04000000)) >> 26;
  *swprof25 = (localVal & ((uint32_t)0x02000000)) >> 25;
  *swprof24 = (localVal & ((uint32_t)0x01000000)) >> 24;
  *swprof23 = (localVal & ((uint32_t)0x00800000)) >> 23;
  *swprof22 = (localVal & ((uint32_t)0x00400000)) >> 22;
  *swprof21 = (localVal & ((uint32_t)0x00200000)) >> 21;
  *swprof20 = (localVal & ((uint32_t)0x00100000)) >> 20;
  *swprof19 = (localVal & ((uint32_t)0x00080000)) >> 19;
  *swprof18 = (localVal & ((uint32_t)0x00040000)) >> 18;
  *swprof17 = (localVal & ((uint32_t)0x00020000)) >> 17;
  *swprof16 = (localVal & ((uint32_t)0x00010000)) >> 16;
  *swprof15 = (localVal & ((uint32_t)0x00008000)) >> 15;
  *swprof14 = (localVal & ((uint32_t)0x00004000)) >> 14;
  *swprof13 = (localVal & ((uint32_t)0x00002000)) >> 13;
  *swprof12 = (localVal & ((uint32_t)0x00001000)) >> 12;
  *swprof11 = (localVal & ((uint32_t)0x00000800)) >> 11;
  *swprof10 = (localVal & ((uint32_t)0x00000400)) >> 10;
  *swprof9 = (localVal & ((uint32_t)0x00000200)) >> 9;
  *swprof8 = (localVal & ((uint32_t)0x00000100)) >> 8;
  *swprof7 = (localVal & ((uint32_t)0x00000080)) >> 7;
  *swprof6 = (localVal & ((uint32_t)0x00000040)) >> 6;
  *swprof5 = (localVal & ((uint32_t)0x00000020)) >> 5;
  *swprof4 = (localVal & ((uint32_t)0x00000010)) >> 4;
  *swprof3 = (localVal & ((uint32_t)0x00000008)) >> 3;
  *swprof2 = (localVal & ((uint32_t)0x00000004)) >> 2;
  *swprof1 = (localVal & ((uint32_t)0x00000002)) >> 1;
  *swprof0 = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_swprof31_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

