kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_swprof31_setf(uint8_t swprof31) {
  ASSERT_ERR((((uint32_t)swprof31 << 31) & ~((uint32_t)0x80000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x80000000)) |
                 ((uint32_t)swprof31 << 31));
}

__INLINE uint8_t ble_swprof30_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void ble_swprof30_setf(uint8_t swprof30) {
  ASSERT_ERR((((uint32_t)swprof30 << 30) & ~((uint32_t)0x40000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x40000000)) |
                 ((uint32_t)swprof30 << 30));
}

__INLINE uint8_t ble_swprof29_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__INLINE void ble_swprof29_setf(uint8_t swprof29) {
  ASSERT_ERR((((uint32_t)swprof29 << 29) & ~((uint32_t)0x20000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x20000000)) |
                 ((uint32_t)swprof29 << 29));
}

__INLINE uint8_t ble_swprof28_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

__INLINE void ble_swprof28_setf(uint8_t swprof28) {
  ASSERT_ERR((((uint32_t)swprof28 << 28) & ~((uint32_t)0x10000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x10000000)) |
                 ((uint32_t)swprof28 << 28));
}

__INLINE uint8_t ble_swprof27_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

__INLINE void ble_swprof27_setf(uint8_t swprof27) {
  ASSERT_ERR((((uint32_t)swprof27 << 27) & ~((uint32_t)0x08000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x08000000)) |
                 ((uint32_t)swprof27 << 27));
}

__INLINE uint8_t ble_swprof26_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

__INLINE void ble_swprof26_setf(uint8_t swprof26) {
  ASSERT_ERR((((uint32_t)swprof26 << 26) & ~((uint32_t)0x04000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x04000000)) |
                 ((uint32_t)swprof26 << 26));
}

__INLINE uint8_t ble_swprof25_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__INLINE void ble_swprof25_setf(uint8_t swprof25) {
  ASSERT_ERR((((uint32_t)swprof25 << 25) & ~((uint32_t)0x02000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x02000000)) |
                 ((uint32_t)swprof25 << 25));
}

__INLINE uint8_t ble_swprof24_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__INLINE void ble_swprof24_setf(uint8_t swprof24) {
  ASSERT_ERR((((uint32_t)swprof24 << 24) & ~((uint32_t)0x01000000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x01000000)) |
                 ((uint32_t)swprof24 << 24));
}

__INLINE uint8_t ble_swprof23_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__INLINE void ble_swprof23_setf(uint8_t swprof23) {
  ASSERT_ERR((((uint32_t)swprof23 << 23) & ~((uint32_t)0x00800000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00800000)) |
                 ((uint32_t)swprof23 << 23));
}

__INLINE uint8_t ble_swprof22_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__INLINE void ble_swprof22_setf(uint8_t swprof22) {
  ASSERT_ERR((((uint32_t)swprof22 << 22) & ~((uint32_t)0x00400000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00400000)) |
                 ((uint32_t)swprof22 << 22));
}

__INLINE uint8_t ble_swprof21_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void ble_swprof21_setf(uint8_t swprof21) {
  ASSERT_ERR((((uint32_t)swprof21 << 21) & ~((uint32_t)0x00200000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00200000)) |
                 ((uint32_t)swprof21 << 21));
}

__INLINE uint8_t ble_swprof20_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void ble_swprof20_setf(uint8_t swprof20) {
  ASSERT_ERR((((uint32_t)swprof20 << 20) & ~((uint32_t)0x00100000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00100000)) |
                 ((uint32_t)swprof20 << 20));
}

__INLINE uint8_t ble_swprof19_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_swprof19_setf(uint8_t swprof19) {
  ASSERT_ERR((((uint32_t)swprof19 << 19) & ~((uint32_t)0x00080000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00080000)) |
                 ((uint32_t)swprof19 << 19));
}

__INLINE uint8_t ble_swprof18_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_swprof18_setf(uint8_t swprof18) {
  ASSERT_ERR((((uint32_t)swprof18 << 18) & ~((uint32_t)0x00040000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00040000)) |
                 ((uint32_t)swprof18 << 18));
}

