kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_swprof17_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void ble_swprof17_setf(uint8_t swprof17) {
  ASSERT_ERR((((uint32_t)swprof17 << 17) & ~((uint32_t)0x00020000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00020000)) |
                 ((uint32_t)swprof17 << 17));
}

__INLINE uint8_t ble_swprof16_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_swprof16_setf(uint8_t swprof16) {
  ASSERT_ERR((((uint32_t)swprof16 << 16) & ~((uint32_t)0x00010000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00010000)) |
                 ((uint32_t)swprof16 << 16));
}

__INLINE uint8_t ble_swprof15_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_swprof15_setf(uint8_t swprof15) {
  ASSERT_ERR((((uint32_t)swprof15 << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)swprof15 << 15));
}

__INLINE uint8_t ble_swprof14_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__INLINE void ble_swprof14_setf(uint8_t swprof14) {
  ASSERT_ERR((((uint32_t)swprof14 << 14) & ~((uint32_t)0x00004000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00004000)) |
                 ((uint32_t)swprof14 << 14));
}

__INLINE uint8_t ble_swprof13_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void ble_swprof13_setf(uint8_t swprof13) {
  ASSERT_ERR((((uint32_t)swprof13 << 13) & ~((uint32_t)0x00002000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00002000)) |
                 ((uint32_t)swprof13 << 13));
}

__INLINE uint8_t ble_swprof12_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void ble_swprof12_setf(uint8_t swprof12) {
  ASSERT_ERR((((uint32_t)swprof12 << 12) & ~((uint32_t)0x00001000)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00001000)) |
                 ((uint32_t)swprof12 << 12));
}

__INLINE uint8_t ble_swprof11_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void ble_swprof11_setf(uint8_t swprof11) {
  ASSERT_ERR((((uint32_t)swprof11 << 11) & ~((uint32_t)0x00000800)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000800)) |
                 ((uint32_t)swprof11 << 11));
}

__INLINE uint8_t ble_swprof10_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void ble_swprof10_setf(uint8_t swprof10) {
  ASSERT_ERR((((uint32_t)swprof10 << 10) & ~((uint32_t)0x00000400)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000400)) |
                 ((uint32_t)swprof10 << 10));
}

__INLINE uint8_t ble_swprof9_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_swprof9_setf(uint8_t swprof9) {
  ASSERT_ERR((((uint32_t)swprof9 << 9) & ~((uint32_t)0x00000200)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000200)) |
                 ((uint32_t)swprof9 << 9));
}

__INLINE uint8_t ble_swprof8_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_swprof8_setf(uint8_t swprof8) {
  ASSERT_ERR((((uint32_t)swprof8 << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)swprof8 << 8));
}

__INLINE uint8_t ble_swprof7_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_swprof7_setf(uint8_t swprof7) {
  ASSERT_ERR((((uint32_t)swprof7 << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)swprof7 << 7));
}

__INLINE uint8_t ble_swprof6_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000040)) >> 6);
}

__INLINE void ble_swprof6_setf(uint8_t swprof6) {
  ASSERT_ERR((((uint32_t)swprof6 << 6) & ~((uint32_t)0x00000040)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000040)) |
                 ((uint32_t)swprof6 << 6));
}

__INLINE uint8_t ble_swprof5_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void ble_swprof5_setf(uint8_t swprof5) {
  ASSERT_ERR((((uint32_t)swprof5 << 5) & ~((uint32_t)0x00000020)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000020)) |
                 ((uint32_t)swprof5 << 5));
}

__INLINE uint8_t ble_swprof4_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_swprof4_setf(uint8_t swprof4) {
  ASSERT_ERR((((uint32_t)swprof4 << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)swprof4 << 4));
}

__INLINE uint8_t ble_swprof3_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

