kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_swprof3_setf(uint8_t swprof3) {
  ASSERT_ERR((((uint32_t)swprof3 << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000008)) |
                 ((uint32_t)swprof3 << 3));
}

__INLINE uint8_t ble_swprof2_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_swprof2_setf(uint8_t swprof2) {
  ASSERT_ERR((((uint32_t)swprof2 << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)swprof2 << 2));
}

__INLINE uint8_t ble_swprof1_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_swprof1_setf(uint8_t swprof1) {
  ASSERT_ERR((((uint32_t)swprof1 << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)swprof1 << 1));
}

__INLINE uint8_t ble_swprof0_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SWPROFILING_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_swprof0_setf(uint8_t swprof0) {
  ASSERT_ERR((((uint32_t)swprof0 << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_SWPROFILING_ADDR,
             (REG_BLE_RD(BLE_SWPROFILING_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)swprof0 << 0));
}

/**
 * @brief RADIOCNTL0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:26               VGACNT   0x0
 *  25:24               LNACNT   0x0
 *     23        AGCFORCE_MODE   0
 *     22            DPCORR_EN   0
 *     21        SPISWACCDBGEN   0
 *     20     CORR_WIN_MSK_DSB   0
 *     19          FORCEAGC_EN   0
 *     18           FORCEBLEIQ   0
 *  13:12              RXLOWIF   0x2
 *     09             BIDIRCLK   0
 *     08            BIDIRDATA   1
 *     07               SPIPOL   0
 *  06:05              SPIFREQ   0x0
 *     04              SPIMODE   0
 *     01              SPICOMP   1
 *     00                SPIGO   0
 * </pre>
 */
#define BLE_RADIOCNTL0_ADDR 0x40000070
#define BLE_RADIOCNTL0_OFFSET 0x00000070
#define BLE_RADIOCNTL0_INDEX 0x0000001C
#define BLE_RADIOCNTL0_RESET 0x00002102

__INLINE uint32_t ble_radiocntl0_get(void) {
  return REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
}

__INLINE void ble_radiocntl0_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR, value);
}

// field definitions
#define BLE_VGACNT_MASK ((uint32_t)0xFC000000)
#define BLE_VGACNT_LSB 26
#define BLE_VGACNT_WIDTH ((uint32_t)0x00000006)
#define BLE_LNACNT_MASK ((uint32_t)0x03000000)
#define BLE_LNACNT_LSB 24
#define BLE_LNACNT_WIDTH ((uint32_t)0x00000002)
#define BLE_AGCFORCE_MODE_BIT ((uint32_t)0x00800000)
#define BLE_AGCFORCE_MODE_POS 23
#define BLE_DPCORR_EN_BIT ((uint32_t)0x00400000)
#define BLE_DPCORR_EN_POS 22
#define BLE_SPISWACCDBGEN_BIT ((uint32_t)0x00200000)
#define BLE_SPISWACCDBGEN_POS 21
#define BLE_CORR_WIN_MSK_DSB_BIT ((uint32_t)0x00100000)
#define BLE_CORR_WIN_MSK_DSB_POS 20
#define BLE_FORCEAGC_EN_BIT ((uint32_t)0x00080000)
#define BLE_FORCEAGC_EN_POS 19
#define BLE_FORCEBLEIQ_BIT ((uint32_t)0x00040000)
#define BLE_FORCEBLEIQ_POS 18
#define BLE_RXLOWIF_MASK ((uint32_t)0x00003000)
#define BLE_RXLOWIF_LSB 12
#define BLE_RXLOWIF_WIDTH ((uint32_t)0x00000002)
#define BLE_BIDIRCLK_BIT ((uint32_t)0x00000200)
#define BLE_BIDIRCLK_POS 9
#define BLE_BIDIRDATA_BIT ((uint32_t)0x00000100)
#define BLE_BIDIRDATA_POS 8
#define BLE_SPIPOL_BIT ((uint32_t)0x00000080)
#define BLE_SPIPOL_POS 7
#define BLE_SPIFREQ_MASK ((uint32_t)0x00000060)
#define BLE_SPIFREQ_LSB 5
#define BLE_SPIFREQ_WIDTH ((uint32_t)0x00000002)
#define BLE_SPIMODE_BIT ((uint32_t)0x00000010)
#define BLE_SPIMODE_POS 4
#define BLE_SPICOMP_BIT ((uint32_t)0x00000002)
#define BLE_SPICOMP_POS 1
#define BLE_SPIGO_BIT ((uint32_t)0x00000001)
#define BLE_SPIGO_POS 0

#define BLE_VGACNT_RST 0x0
#define BLE_LNACNT_RST 0x0
#define BLE_AGCFORCE_MODE_RST 0x0
#define BLE_DPCORR_EN_RST 0x0
#define BLE_SPISWACCDBGEN_RST 0x0
#define BLE_CORR_WIN_MSK_DSB_RST 0x0
#define BLE_FORCEAGC_EN_RST 0x0
#define BLE_FORCEBLEIQ_RST 0x0
#define BLE_RXLOWIF_RST 0x2
#define BLE_BIDIRCLK_RST 0x0
#define BLE_BIDIRDATA_RST 0x1
#define BLE_SPIPOL_RST 0x0
#define BLE_SPIFREQ_RST 0x0
#define BLE_SPIMODE_RST 0x0
#define BLE_SPICOMP_RST 0x1
#define BLE_SPIGO_RST 0x0

__INLINE void ble_radiocntl0_pack(
    uint8_t vgacnt, uint8_t lnacnt, uint8_t agcforcemode, uint8_t dpcorren,
    uint8_t spiswaccdbgen, uint8_t corrwinmskdsb, uint8_t forceagcen,
    uint8_t forcebleiq, uint8_t rxlowif, uint8_t bidirclk, uint8_t bidirdata,
    uint8_t spipol, uint8_t spifreq, uint8_t spimode, uint8_t spigo) {
  ASSERT_ERR((((uint32_t)vgacnt << 26) & ~((uint32_t)0xFC000000)) == 0);
  ASSERT_ERR((((uint32_t)lnacnt << 24) & ~((uint32_t)0x03000000)) == 0);
  ASSERT_ERR((((uint32_t)agcforcemode << 23) & ~((uint32_t)0x00800000)) == 0);
  ASSERT_ERR((((uint32_t)dpcorren << 22) & ~((uint32_t)0x00400000)) == 0);
  ASSERT_ERR((((uint32_t)spiswaccdbgen << 21) & ~((uint32_t)0x00200000)) == 0);
  ASSERT_ERR((((uint32_t)corrwinmskdsb << 20) & ~((uint32_t)0x00100000)) == 0);
  ASSERT_ERR((((uint32_t)forceagcen << 19) & ~((uint32_t)0x00080000)) == 0);
  ASSERT_ERR((((uint32_t)forcebleiq << 18) & ~((uint32_t)0x00040000)) == 0);
  ASSERT_ERR((((uint32_t)rxlowif << 12) & ~((uint32_t)0x00003000)) == 0);
  ASSERT_ERR((((uint32_t)bidirclk << 9) & ~((uint32_t)0x00000200)) == 0);
  ASSERT_ERR((((uint32_t)bidirdata << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)spipol << 7) & ~((uint32_t)0x00000080)) == 0);
  ASSERT_ERR((((uint32_t)spifreq << 5) & ~((uint32_t)0x00000060)) == 0);
  ASSERT_ERR((((uint32_t)spimode << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)spigo << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             ((uint32_t)vgacnt << 26) | ((uint32_t)lnacnt << 24) |
                 ((uint32_t)agcforcemode << 23) | ((uint32_t)dpcorren << 22) |
                 ((uint32_t)spiswaccdbgen << 21) |
                 ((uint32_t)corrwinmskdsb << 20) |
                 ((uint32_t)forceagcen << 19) | ((uint32_t)forcebleiq << 18) |
                 ((uint32_t)rxlowif << 12) | ((uint32_t)bidirclk << 9) |
                 ((uint32_t)bidirdata << 8) | ((uint32_t)spipol << 7) |
                 ((uint32_t)spifreq << 5) | ((uint32_t)spimode << 4) |
                 ((uint32_t)spigo << 0));
}

__INLINE void ble_radiocntl0_unpack(
    uint8_t* vgacnt, uint8_t* lnacnt, uint8_t* agcforcemode, uint8_t* dpcorren,
    uint8_t* spiswaccdbgen, uint8_t* corrwinmskdsb, uint8_t* forceagcen,
    uint8_t* forcebleiq, uint8_t* rxlowif, uint8_t* bidirclk,
    uint8_t* bidirdata, uint8_t* spipol, uint8_t* spifreq, uint8_t* spimode,
    uint8_t* spicomp, uint8_t* spigo) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);

  *vgacnt = (localVal & ((uint32_t)0xFC000000)) >> 26;
  *lnacnt = (localVal & ((uint32_t)0x03000000)) >> 24;
  *agcforcemode = (localVal & ((uint32_t)0x00800000)) >> 23;
  *dpcorren = (localVal & ((uint32_t)0x00400000)) >> 22;
  *spiswaccdbgen = (localVal & ((uint32_t)0x00200000)) >> 21;
  *corrwinmskdsb = (localVal & ((uint32_t)0x00100000)) >> 20;
  *forceagcen = (localVal & ((uint32_t)0x00080000)) >> 19;
  *forcebleiq = (localVal & ((uint32_t)0x00040000)) >> 18;
  *rxlowif = (localVal & ((uint32_t)0x00003000)) >> 12;
  *bidirclk = (localVal & ((uint32_t)0x00000200)) >> 9;
  *bidirdata = (localVal & ((uint32_t)0x00000100)) >> 8;
  *spipol = (localVal & ((uint32_t)0x00000080)) >> 7;
  *spifreq = (localVal & ((uint32_t)0x00000060)) >> 5;
  *spimode = (localVal & ((uint32_t)0x00000010)) >> 4;
  *spicomp = (localVal & ((uint32_t)0x00000002)) >> 1;
  *spigo = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_vgacnt_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0xFC000000)) >> 26);
}

__INLINE void ble_vgacnt_setf(uint8_t vgacnt) {
  ASSERT_ERR((((uint32_t)vgacnt << 26) & ~((uint32_t)0xFC000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0xFC000000)) |
                 ((uint32_t)vgacnt << 26));
}

