kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_lnacnt_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__INLINE void ble_lnacnt_setf(uint8_t lnacnt) {
  ASSERT_ERR((((uint32_t)lnacnt << 24) & ~((uint32_t)0x03000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x03000000)) |
                 ((uint32_t)lnacnt << 24));
}

__INLINE uint8_t ble_agcforce_mode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

__INLINE void ble_agcforce_mode_setf(uint8_t agcforcemode) {
  ASSERT_ERR((((uint32_t)agcforcemode << 23) & ~((uint32_t)0x00800000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00800000)) |
                 ((uint32_t)agcforcemode << 23));
}

__INLINE uint8_t ble_dpcorr_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00400000)) >> 22);
}

__INLINE void ble_dpcorr_en_setf(uint8_t dpcorren) {
  ASSERT_ERR((((uint32_t)dpcorren << 22) & ~((uint32_t)0x00400000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00400000)) |
                 ((uint32_t)dpcorren << 22));
}

__INLINE uint8_t ble_spiswaccdbgen_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void ble_spiswaccdbgen_setf(uint8_t spiswaccdbgen) {
  ASSERT_ERR((((uint32_t)spiswaccdbgen << 21) & ~((uint32_t)0x00200000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00200000)) |
                 ((uint32_t)spiswaccdbgen << 21));
}

__INLINE uint8_t ble_corr_win_msk_dsb_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void ble_corr_win_msk_dsb_setf(uint8_t corrwinmskdsb) {
  ASSERT_ERR((((uint32_t)corrwinmskdsb << 20) & ~((uint32_t)0x00100000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00100000)) |
                 ((uint32_t)corrwinmskdsb << 20));
}

__INLINE uint8_t ble_forceagc_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_forceagc_en_setf(uint8_t forceagcen) {
  ASSERT_ERR((((uint32_t)forceagcen << 19) & ~((uint32_t)0x00080000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00080000)) |
                 ((uint32_t)forceagcen << 19));
}

__INLINE uint8_t ble_forcebleiq_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_forcebleiq_setf(uint8_t forcebleiq) {
  ASSERT_ERR((((uint32_t)forcebleiq << 18) & ~((uint32_t)0x00040000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00040000)) |
                 ((uint32_t)forcebleiq << 18));
}

__INLINE uint8_t ble_rxlowif_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00003000)) >> 12);
}

__INLINE void ble_rxlowif_setf(uint8_t rxlowif) {
  ASSERT_ERR((((uint32_t)rxlowif << 12) & ~((uint32_t)0x00003000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00003000)) |
                 ((uint32_t)rxlowif << 12));
}

__INLINE uint8_t ble_bidirclk_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_bidirclk_setf(uint8_t bidirclk) {
  ASSERT_ERR((((uint32_t)bidirclk << 9) & ~((uint32_t)0x00000200)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000200)) |
                 ((uint32_t)bidirclk << 9));
}

__INLINE uint8_t ble_bidirdata_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_bidirdata_setf(uint8_t bidirdata) {
  ASSERT_ERR((((uint32_t)bidirdata << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)bidirdata << 8));
}

__INLINE uint8_t ble_spipol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000080)) >> 7);
}

__INLINE void ble_spipol_setf(uint8_t spipol) {
  ASSERT_ERR((((uint32_t)spipol << 7) & ~((uint32_t)0x00000080)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000080)) |
                 ((uint32_t)spipol << 7));
}

__INLINE uint8_t ble_spifreq_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000060)) >> 5);
}

__INLINE void ble_spifreq_setf(uint8_t spifreq) {
  ASSERT_ERR((((uint32_t)spifreq << 5) & ~((uint32_t)0x00000060)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000060)) |
                 ((uint32_t)spifreq << 5));
}

__INLINE uint8_t ble_spimode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_spimode_setf(uint8_t spimode) {
  ASSERT_ERR((((uint32_t)spimode << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)spimode << 4));
}

__INLINE uint8_t ble_spicomp_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t ble_spigo_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL0_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_spigo_setf(uint8_t spigo) {
  ASSERT_ERR((((uint32_t)spigo << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL0_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL0_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)spigo << 0));
}

/**
 * @brief RADIOCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     28            RAMP_TYPE   0
 *  27:24             RAMPSTEP   0x0
 *  20:16               XRFSEL   0x0
 *  15:00               SPIPTR   0x0
 * </pre>
 */
#define BLE_RADIOCNTL1_ADDR 0x40000074
#define BLE_RADIOCNTL1_OFFSET 0x00000074
#define BLE_RADIOCNTL1_INDEX 0x0000001D
#define BLE_RADIOCNTL1_RESET 0x00000000

__INLINE uint32_t ble_radiocntl1_get(void) {
  return REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
}

__INLINE void ble_radiocntl1_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR, value);
}

