kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_RAMP_TYPE_BIT ((uint32_t)0x10000000)
#define BLE_RAMP_TYPE_POS 28
#define BLE_RAMPSTEP_MASK ((uint32_t)0x0F000000)
#define BLE_RAMPSTEP_LSB 24
#define BLE_RAMPSTEP_WIDTH ((uint32_t)0x00000004)
#define BLE_XRFSEL_MASK ((uint32_t)0x001F0000)
#define BLE_XRFSEL_LSB 16
#define BLE_XRFSEL_WIDTH ((uint32_t)0x00000005)
#define BLE_SPIPTR_MASK ((uint32_t)0x0000FFFF)
#define BLE_SPIPTR_LSB 0
#define BLE_SPIPTR_WIDTH ((uint32_t)0x00000010)

#define BLE_RAMP_TYPE_RST 0x0
#define BLE_RAMPSTEP_RST 0x0
#define BLE_XRFSEL_RST 0x0
#define BLE_SPIPTR_RST 0x0

__INLINE void ble_radiocntl1_pack(uint8_t ramptype, uint8_t rampstep,
                                  uint8_t xrfsel, uint16_t spiptr) {
  ASSERT_ERR((((uint32_t)ramptype << 28) & ~((uint32_t)0x10000000)) == 0);
  ASSERT_ERR((((uint32_t)rampstep << 24) & ~((uint32_t)0x0F000000)) == 0);
  ASSERT_ERR((((uint32_t)xrfsel << 16) & ~((uint32_t)0x001F0000)) == 0);
  ASSERT_ERR((((uint32_t)spiptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR,
             ((uint32_t)ramptype << 28) | ((uint32_t)rampstep << 24) |
                 ((uint32_t)xrfsel << 16) | ((uint32_t)spiptr << 0));
}

__INLINE void ble_radiocntl1_unpack(uint8_t* ramptype, uint8_t* rampstep,
                                    uint8_t* xrfsel, uint16_t* spiptr) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);

  *ramptype = (localVal & ((uint32_t)0x10000000)) >> 28;
  *rampstep = (localVal & ((uint32_t)0x0F000000)) >> 24;
  *xrfsel = (localVal & ((uint32_t)0x001F0000)) >> 16;
  *spiptr = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint8_t ble_ramp_type_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
  return ((localVal & ((uint32_t)0x10000000)) >> 28);
}

__INLINE void ble_ramp_type_setf(uint8_t ramptype) {
  ASSERT_ERR((((uint32_t)ramptype << 28) & ~((uint32_t)0x10000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x10000000)) |
                 ((uint32_t)ramptype << 28));
}

__INLINE uint8_t ble_rampstep_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
  return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void ble_rampstep_setf(uint8_t rampstep) {
  ASSERT_ERR((((uint32_t)rampstep << 24) & ~((uint32_t)0x0F000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x0F000000)) |
                 ((uint32_t)rampstep << 24));
}

__INLINE uint8_t ble_xrfsel_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
  return ((localVal & ((uint32_t)0x001F0000)) >> 16);
}

__INLINE void ble_xrfsel_setf(uint8_t xrfsel) {
  ASSERT_ERR((((uint32_t)xrfsel << 16) & ~((uint32_t)0x001F0000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x001F0000)) |
                 ((uint32_t)xrfsel << 16));
}

__INLINE uint16_t ble_spiptr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL1_ADDR);
  return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_spiptr_setf(uint16_t spiptr) {
  ASSERT_ERR((((uint32_t)spiptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL1_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL1_ADDR) & ~((uint32_t)0x0000FFFF)) |
                 ((uint32_t)spiptr << 0));
}

#if RW_BLE_SUPPORT
/**
 * @brief RADIOCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:24          REGUP_DELAY   0x0
 *  23:18           RXDN_DELAY   0x0
 *  17:12           RXUP_DELAY   0x0
 *  11:06           TXDN_DELAY   0x0
 *  05:00           TXUP_DELAY   0x0
 * </pre>
 */
#define BLE_RADIOCNTL2_ADDR 0x40000078
#define BLE_RADIOCNTL2_OFFSET 0x00000078
#define BLE_RADIOCNTL2_INDEX 0x0000001E
#define BLE_RADIOCNTL2_RESET 0x00000000

__INLINE uint32_t ble_radiocntl2_get(void) {
  return REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
}

__INLINE void ble_radiocntl2_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR, value);
}

// field definitions
#define BLE_REGUP_DELAY_MASK ((uint32_t)0x3F000000)
#define BLE_REGUP_DELAY_LSB 24
#define BLE_REGUP_DELAY_WIDTH ((uint32_t)0x00000006)
#define BLE_RXDN_DELAY_MASK ((uint32_t)0x00FC0000)
#define BLE_RXDN_DELAY_LSB 18
#define BLE_RXDN_DELAY_WIDTH ((uint32_t)0x00000006)
#define BLE_RXUP_DELAY_MASK ((uint32_t)0x0003F000)
#define BLE_RXUP_DELAY_LSB 12
#define BLE_RXUP_DELAY_WIDTH ((uint32_t)0x00000006)
#define BLE_TXDN_DELAY_MASK ((uint32_t)0x00000FC0)
#define BLE_TXDN_DELAY_LSB 6
#define BLE_TXDN_DELAY_WIDTH ((uint32_t)0x00000006)
#define BLE_TXUP_DELAY_MASK ((uint32_t)0x0000003F)
#define BLE_TXUP_DELAY_LSB 0
#define BLE_TXUP_DELAY_WIDTH ((uint32_t)0x00000006)

#define BLE_REGUP_DELAY_RST 0x0
#define BLE_RXDN_DELAY_RST 0x0
#define BLE_RXUP_DELAY_RST 0x0
#define BLE_TXDN_DELAY_RST 0x0
#define BLE_TXUP_DELAY_RST 0x0

__INLINE void ble_radiocntl2_pack(uint8_t regupdelay, uint8_t rxdndelay,
                                  uint8_t rxupdelay, uint8_t txdndelay,
                                  uint8_t txupdelay) {
  ASSERT_ERR((((uint32_t)regupdelay << 24) & ~((uint32_t)0x3F000000)) == 0);
  ASSERT_ERR((((uint32_t)rxdndelay << 18) & ~((uint32_t)0x00FC0000)) == 0);
  ASSERT_ERR((((uint32_t)rxupdelay << 12) & ~((uint32_t)0x0003F000)) == 0);
  ASSERT_ERR((((uint32_t)txdndelay << 6) & ~((uint32_t)0x00000FC0)) == 0);
  ASSERT_ERR((((uint32_t)txupdelay << 0) & ~((uint32_t)0x0000003F)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             ((uint32_t)regupdelay << 24) | ((uint32_t)rxdndelay << 18) |
                 ((uint32_t)rxupdelay << 12) | ((uint32_t)txdndelay << 6) |
                 ((uint32_t)txupdelay << 0));
}

__INLINE void ble_radiocntl2_unpack(uint8_t* regupdelay, uint8_t* rxdndelay,
                                    uint8_t* rxupdelay, uint8_t* txdndelay,
                                    uint8_t* txupdelay) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);

  *regupdelay = (localVal & ((uint32_t)0x3F000000)) >> 24;
  *rxdndelay = (localVal & ((uint32_t)0x00FC0000)) >> 18;
  *rxupdelay = (localVal & ((uint32_t)0x0003F000)) >> 12;
  *txdndelay = (localVal & ((uint32_t)0x00000FC0)) >> 6;
  *txupdelay = (localVal & ((uint32_t)0x0000003F)) >> 0;
}

__INLINE uint8_t ble_regup_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
  return ((localVal & ((uint32_t)0x3F000000)) >> 24);
}

