kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_regup_delay_setf(uint8_t regupdelay) {
  ASSERT_ERR((((uint32_t)regupdelay << 24) & ~((uint32_t)0x3F000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x3F000000)) |
                 ((uint32_t)regupdelay << 24));
}

__INLINE uint8_t ble_rxdn_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
  return ((localVal & ((uint32_t)0x00FC0000)) >> 18);
}

__INLINE void ble_rxdn_delay_setf(uint8_t rxdndelay) {
  ASSERT_ERR((((uint32_t)rxdndelay << 18) & ~((uint32_t)0x00FC0000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x00FC0000)) |
                 ((uint32_t)rxdndelay << 18));
}

__INLINE uint8_t ble_rxup_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
  return ((localVal & ((uint32_t)0x0003F000)) >> 12);
}

__INLINE void ble_rxup_delay_setf(uint8_t rxupdelay) {
  ASSERT_ERR((((uint32_t)rxupdelay << 12) & ~((uint32_t)0x0003F000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x0003F000)) |
                 ((uint32_t)rxupdelay << 12));
}

__INLINE uint8_t ble_txdn_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
  return ((localVal & ((uint32_t)0x00000FC0)) >> 6);
}

__INLINE void ble_txdn_delay_setf(uint8_t txdndelay) {
  ASSERT_ERR((((uint32_t)txdndelay << 6) & ~((uint32_t)0x00000FC0)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x00000FC0)) |
                 ((uint32_t)txdndelay << 6));
}

__INLINE uint8_t ble_txup_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL2_ADDR);
  return ((localVal & ((uint32_t)0x0000003F)) >> 0);
}

__INLINE void ble_txup_delay_setf(uint8_t txupdelay) {
  ASSERT_ERR((((uint32_t)txupdelay << 0) & ~((uint32_t)0x0000003F)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL2_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL2_ADDR) & ~((uint32_t)0x0000003F)) |
                 ((uint32_t)txupdelay << 0));
}

#endif  // RW_BLE_SUPPORT
#if RW_BLE_CUST1_INST
/**
 * @brief RADIOCNTL3 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24           PBUS_VALUE   0x0
 *     18           PSTB_VALUE   0
 *  17:16           PSEL_VALUE   0x0
 *     15            RX_ON_POL   0
 *     14            TX_EN_POL   0
 *     13            PA_ON_POL   0
 *     12           REG_ON_POL   0
 *     11          RX_ON_VALUE   0
 *     10          TX_EN_VALUE   0
 *     09          PA_ON_VALUE   0
 *     08         REG_ON_VALUE   0
 *     04           FORCE_PBUS   0
 *     03          FORCE_RX_ON   0
 *     02          FORCE_TX_EN   0
 *     01          FORCE_PA_ON   0
 *     00         FORCE_REG_ON   0
 * </pre>
 */
#define BLE_RADIOCNTL3_ADDR 0x4000007C
#define BLE_RADIOCNTL3_OFFSET 0x0000007C
#define BLE_RADIOCNTL3_INDEX 0x0000001F
#define BLE_RADIOCNTL3_RESET 0x00000000

__INLINE uint32_t ble_radiocntl3_get(void) {
  return REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
}

__INLINE void ble_radiocntl3_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR, value);
}

// field definitions
#define BLE_PBUS_VALUE_MASK ((uint32_t)0xFF000000)
#define BLE_PBUS_VALUE_LSB 24
#define BLE_PBUS_VALUE_WIDTH ((uint32_t)0x00000008)
#define BLE_PSTB_VALUE_BIT ((uint32_t)0x00040000)
#define BLE_PSTB_VALUE_POS 18
#define BLE_PSEL_VALUE_MASK ((uint32_t)0x00030000)
#define BLE_PSEL_VALUE_LSB 16
#define BLE_PSEL_VALUE_WIDTH ((uint32_t)0x00000002)
#define BLE_RX_ON_POL_BIT ((uint32_t)0x00008000)
#define BLE_RX_ON_POL_POS 15
#define BLE_TX_EN_POL_BIT ((uint32_t)0x00004000)
#define BLE_TX_EN_POL_POS 14
#define BLE_PA_ON_POL_BIT ((uint32_t)0x00002000)
#define BLE_PA_ON_POL_POS 13
#define BLE_REG_ON_POL_BIT ((uint32_t)0x00001000)
#define BLE_REG_ON_POL_POS 12
#define BLE_RX_ON_VALUE_BIT ((uint32_t)0x00000800)
#define BLE_RX_ON_VALUE_POS 11
#define BLE_TX_EN_VALUE_BIT ((uint32_t)0x00000400)
#define BLE_TX_EN_VALUE_POS 10
#define BLE_PA_ON_VALUE_BIT ((uint32_t)0x00000200)
#define BLE_PA_ON_VALUE_POS 9
#define BLE_REG_ON_VALUE_BIT ((uint32_t)0x00000100)
#define BLE_REG_ON_VALUE_POS 8
#define BLE_FORCE_PBUS_BIT ((uint32_t)0x00000010)
#define BLE_FORCE_PBUS_POS 4
#define BLE_FORCE_RX_ON_BIT ((uint32_t)0x00000008)
#define BLE_FORCE_RX_ON_POS 3
#define BLE_FORCE_TX_EN_BIT ((uint32_t)0x00000004)
#define BLE_FORCE_TX_EN_POS 2
#define BLE_FORCE_PA_ON_BIT ((uint32_t)0x00000002)
#define BLE_FORCE_PA_ON_POS 1
#define BLE_FORCE_REG_ON_BIT ((uint32_t)0x00000001)
#define BLE_FORCE_REG_ON_POS 0

#define BLE_PBUS_VALUE_RST 0x0
#define BLE_PSTB_VALUE_RST 0x0
#define BLE_PSEL_VALUE_RST 0x0
#define BLE_RX_ON_POL_RST 0x0
#define BLE_TX_EN_POL_RST 0x0
#define BLE_PA_ON_POL_RST 0x0
#define BLE_REG_ON_POL_RST 0x0
#define BLE_RX_ON_VALUE_RST 0x0
#define BLE_TX_EN_VALUE_RST 0x0
#define BLE_PA_ON_VALUE_RST 0x0
#define BLE_REG_ON_VALUE_RST 0x0
#define BLE_FORCE_PBUS_RST 0x0
#define BLE_FORCE_RX_ON_RST 0x0
#define BLE_FORCE_TX_EN_RST 0x0
#define BLE_FORCE_PA_ON_RST 0x0
#define BLE_FORCE_REG_ON_RST 0x0

__INLINE void ble_radiocntl3_pack(uint8_t pbusvalue, uint8_t pstbvalue,
                                  uint8_t pselvalue, uint8_t rxonpol,
                                  uint8_t txenpol, uint8_t paonpol,
                                  uint8_t regonpol, uint8_t rxonvalue,
                                  uint8_t txenvalue, uint8_t paonvalue,
                                  uint8_t regonvalue, uint8_t forcepbus,
                                  uint8_t forcerxon, uint8_t forcetxen,
                                  uint8_t forcepaon, uint8_t forceregon) {
  ASSERT_ERR((((uint32_t)pbusvalue << 24) & ~((uint32_t)0xFF000000)) == 0);
  ASSERT_ERR((((uint32_t)pstbvalue << 18) & ~((uint32_t)0x00040000)) == 0);
  ASSERT_ERR((((uint32_t)pselvalue << 16) & ~((uint32_t)0x00030000)) == 0);
  ASSERT_ERR((((uint32_t)rxonpol << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)txenpol << 14) & ~((uint32_t)0x00004000)) == 0);
  ASSERT_ERR((((uint32_t)paonpol << 13) & ~((uint32_t)0x00002000)) == 0);
  ASSERT_ERR((((uint32_t)regonpol << 12) & ~((uint32_t)0x00001000)) == 0);
  ASSERT_ERR((((uint32_t)rxonvalue << 11) & ~((uint32_t)0x00000800)) == 0);
  ASSERT_ERR((((uint32_t)txenvalue << 10) & ~((uint32_t)0x00000400)) == 0);
  ASSERT_ERR((((uint32_t)paonvalue << 9) & ~((uint32_t)0x00000200)) == 0);
  ASSERT_ERR((((uint32_t)regonvalue << 8) & ~((uint32_t)0x00000100)) == 0);
  ASSERT_ERR((((uint32_t)forcepbus << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)forcerxon << 3) & ~((uint32_t)0x00000008)) == 0);
  ASSERT_ERR((((uint32_t)forcetxen << 2) & ~((uint32_t)0x00000004)) == 0);
  ASSERT_ERR((((uint32_t)forcepaon << 1) & ~((uint32_t)0x00000002)) == 0);
  ASSERT_ERR((((uint32_t)forceregon << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             ((uint32_t)pbusvalue << 24) | ((uint32_t)pstbvalue << 18) |
                 ((uint32_t)pselvalue << 16) | ((uint32_t)rxonpol << 15) |
                 ((uint32_t)txenpol << 14) | ((uint32_t)paonpol << 13) |
                 ((uint32_t)regonpol << 12) | ((uint32_t)rxonvalue << 11) |
                 ((uint32_t)txenvalue << 10) | ((uint32_t)paonvalue << 9) |
                 ((uint32_t)regonvalue << 8) | ((uint32_t)forcepbus << 4) |
                 ((uint32_t)forcerxon << 3) | ((uint32_t)forcetxen << 2) |
                 ((uint32_t)forcepaon << 1) | ((uint32_t)forceregon << 0));
}

