kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_radiocntl3_unpack(uint8_t* pbusvalue, uint8_t* pstbvalue,
                                    uint8_t* pselvalue, uint8_t* rxonpol,
                                    uint8_t* txenpol, uint8_t* paonpol,
                                    uint8_t* regonpol, uint8_t* rxonvalue,
                                    uint8_t* txenvalue, uint8_t* paonvalue,
                                    uint8_t* regonvalue, uint8_t* forcepbus,
                                    uint8_t* forcerxon, uint8_t* forcetxen,
                                    uint8_t* forcepaon, uint8_t* forceregon) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);

  *pbusvalue = (localVal & ((uint32_t)0xFF000000)) >> 24;
  *pstbvalue = (localVal & ((uint32_t)0x00040000)) >> 18;
  *pselvalue = (localVal & ((uint32_t)0x00030000)) >> 16;
  *rxonpol = (localVal & ((uint32_t)0x00008000)) >> 15;
  *txenpol = (localVal & ((uint32_t)0x00004000)) >> 14;
  *paonpol = (localVal & ((uint32_t)0x00002000)) >> 13;
  *regonpol = (localVal & ((uint32_t)0x00001000)) >> 12;
  *rxonvalue = (localVal & ((uint32_t)0x00000800)) >> 11;
  *txenvalue = (localVal & ((uint32_t)0x00000400)) >> 10;
  *paonvalue = (localVal & ((uint32_t)0x00000200)) >> 9;
  *regonvalue = (localVal & ((uint32_t)0x00000100)) >> 8;
  *forcepbus = (localVal & ((uint32_t)0x00000010)) >> 4;
  *forcerxon = (localVal & ((uint32_t)0x00000008)) >> 3;
  *forcetxen = (localVal & ((uint32_t)0x00000004)) >> 2;
  *forcepaon = (localVal & ((uint32_t)0x00000002)) >> 1;
  *forceregon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t ble_pbus_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0xFF000000)) >> 24);
}

__INLINE void ble_pbus_value_setf(uint8_t pbusvalue) {
  ASSERT_ERR((((uint32_t)pbusvalue << 24) & ~((uint32_t)0xFF000000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0xFF000000)) |
                 ((uint32_t)pbusvalue << 24));
}

__INLINE uint8_t ble_pstb_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_pstb_value_setf(uint8_t pstbvalue) {
  ASSERT_ERR((((uint32_t)pstbvalue << 18) & ~((uint32_t)0x00040000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00040000)) |
                 ((uint32_t)pstbvalue << 18));
}

__INLINE uint8_t ble_psel_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__INLINE void ble_psel_value_setf(uint8_t pselvalue) {
  ASSERT_ERR((((uint32_t)pselvalue << 16) & ~((uint32_t)0x00030000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00030000)) |
                 ((uint32_t)pselvalue << 16));
}

__INLINE uint8_t ble_rx_on_pol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_rx_on_pol_setf(uint8_t rxonpol) {
  ASSERT_ERR((((uint32_t)rxonpol << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)rxonpol << 15));
}

__INLINE uint8_t ble_tx_en_pol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__INLINE void ble_tx_en_pol_setf(uint8_t txenpol) {
  ASSERT_ERR((((uint32_t)txenpol << 14) & ~((uint32_t)0x00004000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00004000)) |
                 ((uint32_t)txenpol << 14));
}

__INLINE uint8_t ble_pa_on_pol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void ble_pa_on_pol_setf(uint8_t paonpol) {
  ASSERT_ERR((((uint32_t)paonpol << 13) & ~((uint32_t)0x00002000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00002000)) |
                 ((uint32_t)paonpol << 13));
}

__INLINE uint8_t ble_reg_on_pol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void ble_reg_on_pol_setf(uint8_t regonpol) {
  ASSERT_ERR((((uint32_t)regonpol << 12) & ~((uint32_t)0x00001000)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00001000)) |
                 ((uint32_t)regonpol << 12));
}

__INLINE uint8_t ble_rx_on_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void ble_rx_on_value_setf(uint8_t rxonvalue) {
  ASSERT_ERR((((uint32_t)rxonvalue << 11) & ~((uint32_t)0x00000800)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000800)) |
                 ((uint32_t)rxonvalue << 11));
}

__INLINE uint8_t ble_tx_en_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void ble_tx_en_value_setf(uint8_t txenvalue) {
  ASSERT_ERR((((uint32_t)txenvalue << 10) & ~((uint32_t)0x00000400)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000400)) |
                 ((uint32_t)txenvalue << 10));
}

__INLINE uint8_t ble_pa_on_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void ble_pa_on_value_setf(uint8_t paonvalue) {
  ASSERT_ERR((((uint32_t)paonvalue << 9) & ~((uint32_t)0x00000200)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000200)) |
                 ((uint32_t)paonvalue << 9));
}

__INLINE uint8_t ble_reg_on_value_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

__INLINE void ble_reg_on_value_setf(uint8_t regonvalue) {
  ASSERT_ERR((((uint32_t)regonvalue << 8) & ~((uint32_t)0x00000100)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000100)) |
                 ((uint32_t)regonvalue << 8));
}

__INLINE uint8_t ble_force_pbus_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_force_pbus_setf(uint8_t forcepbus) {
  ASSERT_ERR((((uint32_t)forcepbus << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)forcepbus << 4));
}

