kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint8_t ble_force_rx_on_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_force_rx_on_setf(uint8_t forcerxon) {
  ASSERT_ERR((((uint32_t)forcerxon << 3) & ~((uint32_t)0x00000008)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000008)) |
                 ((uint32_t)forcerxon << 3));
}

__INLINE uint8_t ble_force_tx_en_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_force_tx_en_setf(uint8_t forcetxen) {
  ASSERT_ERR((((uint32_t)forcetxen << 2) & ~((uint32_t)0x00000004)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000004)) |
                 ((uint32_t)forcetxen << 2));
}

__INLINE uint8_t ble_force_pa_on_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void ble_force_pa_on_setf(uint8_t forcepaon) {
  ASSERT_ERR((((uint32_t)forcepaon << 1) & ~((uint32_t)0x00000002)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000002)) |
                 ((uint32_t)forcepaon << 1));
}

__INLINE uint8_t ble_force_reg_on_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL3_ADDR);
  return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void ble_force_reg_on_setf(uint8_t forceregon) {
  ASSERT_ERR((((uint32_t)forceregon << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL3_ADDR,
             (REG_BLE_RD(BLE_RADIOCNTL3_ADDR) & ~((uint32_t)0x00000001)) |
                 ((uint32_t)forceregon << 0));
}

#endif  // RW_BLE_CUST1_INST
/**
 * @brief RADIOPWRUPDN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:24          RTRIP_DELAY   0x0
 *  23:16              RXPWRUP   0xD2
 *  11:08              TXPWRDN   0x3
 *  07:00              TXPWRUP   0xD2
 * </pre>
 */
#define BLE_RADIOPWRUPDN_ADDR 0x40000080
#define BLE_RADIOPWRUPDN_OFFSET 0x00000080
#define BLE_RADIOPWRUPDN_INDEX 0x00000020
#define BLE_RADIOPWRUPDN_RESET 0x00D203D2

__INLINE uint32_t ble_radiopwrupdn_get(void) {
  return REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
}

__INLINE void ble_radiopwrupdn_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR, value);
}

// field definitions
#define BLE_RTRIP_DELAY_MASK ((uint32_t)0x7F000000)
#define BLE_RTRIP_DELAY_LSB 24
#define BLE_RTRIP_DELAY_WIDTH ((uint32_t)0x00000007)
#define BLE_RXPWRUP_MASK ((uint32_t)0x00FF0000)
#define BLE_RXPWRUP_LSB 16
#define BLE_RXPWRUP_WIDTH ((uint32_t)0x00000008)
#define BLE_TXPWRDN_MASK ((uint32_t)0x00000F00)
#define BLE_TXPWRDN_LSB 8
#define BLE_TXPWRDN_WIDTH ((uint32_t)0x00000004)
#define BLE_TXPWRUP_MASK ((uint32_t)0x000000FF)
#define BLE_TXPWRUP_LSB 0
#define BLE_TXPWRUP_WIDTH ((uint32_t)0x00000008)

#define BLE_RTRIP_DELAY_RST 0x0
#define BLE_RXPWRUP_RST 0xD2
#define BLE_TXPWRDN_RST 0x3
#define BLE_TXPWRUP_RST 0xD2

__INLINE void ble_radiopwrupdn_pack(uint8_t rtripdelay, uint8_t rxpwrup,
                                    uint8_t txpwrdn, uint8_t txpwrup) {
  ASSERT_ERR((((uint32_t)rtripdelay << 24) & ~((uint32_t)0x7F000000)) == 0);
  ASSERT_ERR((((uint32_t)rxpwrup << 16) & ~((uint32_t)0x00FF0000)) == 0);
  ASSERT_ERR((((uint32_t)txpwrdn << 8) & ~((uint32_t)0x00000F00)) == 0);
  ASSERT_ERR((((uint32_t)txpwrup << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,
             ((uint32_t)rtripdelay << 24) | ((uint32_t)rxpwrup << 16) |
                 ((uint32_t)txpwrdn << 8) | ((uint32_t)txpwrup << 0));
}

__INLINE void ble_radiopwrupdn_unpack(uint8_t* rtripdelay, uint8_t* rxpwrup,
                                      uint8_t* txpwrdn, uint8_t* txpwrup) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);

  *rtripdelay = (localVal & ((uint32_t)0x7F000000)) >> 24;
  *rxpwrup = (localVal & ((uint32_t)0x00FF0000)) >> 16;
  *txpwrdn = (localVal & ((uint32_t)0x00000F00)) >> 8;
  *txpwrup = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_rtrip_delay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
  return ((localVal & ((uint32_t)0x7F000000)) >> 24);
}

__INLINE void ble_rtrip_delay_setf(uint8_t rtripdelay) {
  ASSERT_ERR((((uint32_t)rtripdelay << 24) & ~((uint32_t)0x7F000000)) == 0);
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,
             (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x7F000000)) |
                 ((uint32_t)rtripdelay << 24));
}

__INLINE uint8_t ble_rxpwrup_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
  return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void ble_rxpwrup_setf(uint8_t rxpwrup) {
  ASSERT_ERR((((uint32_t)rxpwrup << 16) & ~((uint32_t)0x00FF0000)) == 0);
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,
             (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x00FF0000)) |
                 ((uint32_t)rxpwrup << 16));
}

__INLINE uint8_t ble_txpwrdn_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
  return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void ble_txpwrdn_setf(uint8_t txpwrdn) {
  ASSERT_ERR((((uint32_t)txpwrdn << 8) & ~((uint32_t)0x00000F00)) == 0);
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,
             (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x00000F00)) |
                 ((uint32_t)txpwrdn << 8));
}

__INLINE uint8_t ble_txpwrup_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_txpwrup_setf(uint8_t txpwrup) {
  ASSERT_ERR((((uint32_t)txpwrup << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_RADIOPWRUPDN_ADDR,
             (REG_BLE_RD(BLE_RADIOPWRUPDN_ADDR) & ~((uint32_t)0x000000FF)) |
                 ((uint32_t)txpwrup << 0));
}

#if RW_BLE_SUPPORT
/**
 * @brief RADIOCNTL4 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:00      FORCEAGC_LENGTH   0x0
 * </pre>
 */
#define BLE_RADIOCNTL4_ADDR 0x40000084
#define BLE_RADIOCNTL4_OFFSET 0x00000084
#define BLE_RADIOCNTL4_INDEX 0x00000021
#define BLE_RADIOCNTL4_RESET 0x00000000

