kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE uint32_t ble_radiocntl4_get(void) {
  return REG_BLE_RD(BLE_RADIOCNTL4_ADDR);
}

__INLINE void ble_radiocntl4_set(uint32_t value) {
  REG_BLE_WR(BLE_RADIOCNTL4_ADDR, value);
}

// field definitions
#define BLE_FORCEAGC_LENGTH_MASK ((uint32_t)0x00000FFF)
#define BLE_FORCEAGC_LENGTH_LSB 0
#define BLE_FORCEAGC_LENGTH_WIDTH ((uint32_t)0x0000000C)

#define BLE_FORCEAGC_LENGTH_RST 0x0

__INLINE uint16_t ble_forceagc_length_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RADIOCNTL4_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00000FFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_forceagc_length_setf(uint16_t forceagclength) {
  ASSERT_ERR((((uint32_t)forceagclength << 0) & ~((uint32_t)0x00000FFF)) == 0);
  REG_BLE_WR(BLE_RADIOCNTL4_ADDR, (uint32_t)forceagclength << 0);
}

#endif  // RW_BLE_SUPPORT
/**
 * @brief ADVCHMAP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  02:00             ADVCHMAP   0x7
 * </pre>
 */
#define BLE_ADVCHMAP_ADDR 0x40000090
#define BLE_ADVCHMAP_OFFSET 0x00000090
#define BLE_ADVCHMAP_INDEX 0x00000024
#define BLE_ADVCHMAP_RESET 0x00000007

__INLINE uint32_t ble_advchmap_get(void) {
  return REG_BLE_RD(BLE_ADVCHMAP_ADDR);
}

__INLINE void ble_advchmap_set(uint32_t value) {
  REG_BLE_WR(BLE_ADVCHMAP_ADDR, value);
}

// field definitions
#define BLE_ADVCHMAP_MASK ((uint32_t)0x00000007)
#define BLE_ADVCHMAP_LSB 0
#define BLE_ADVCHMAP_WIDTH ((uint32_t)0x00000003)

#define BLE_ADVCHMAP_RST 0x7

__INLINE uint8_t ble_advchmap_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ADVCHMAP_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00000007)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_advchmap_setf(uint8_t advchmap) {
  ASSERT_ERR((((uint32_t)advchmap << 0) & ~((uint32_t)0x00000007)) == 0);
  REG_BLE_WR(BLE_ADVCHMAP_ADDR, (uint32_t)advchmap << 0);
}

/**
 * @brief ADVTIM register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  13:00               ADVINT   0x0
 * </pre>
 */
#define BLE_ADVTIM_ADDR 0x400000A0
#define BLE_ADVTIM_OFFSET 0x000000A0
#define BLE_ADVTIM_INDEX 0x00000028
#define BLE_ADVTIM_RESET 0x00000000

__INLINE uint32_t ble_advtim_get(void) { return REG_BLE_RD(BLE_ADVTIM_ADDR); }

__INLINE void ble_advtim_set(uint32_t value) {
  REG_BLE_WR(BLE_ADVTIM_ADDR, value);
}

// field definitions
#define BLE_ADVINT_MASK ((uint32_t)0x00003FFF)
#define BLE_ADVINT_LSB 0
#define BLE_ADVINT_WIDTH ((uint32_t)0x0000000E)

#define BLE_ADVINT_RST 0x0

__INLINE uint16_t ble_advint_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ADVTIM_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00003FFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_advint_setf(uint16_t advint) {
  ASSERT_ERR((((uint32_t)advint << 0) & ~((uint32_t)0x00003FFF)) == 0);
  REG_BLE_WR(BLE_ADVTIM_ADDR, (uint32_t)advint << 0);
}

/**
 * @brief ACTSCANSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  24:16              BACKOFF   0x1
 *  08:00           UPPERLIMIT   0x1
 * </pre>
 */
#define BLE_ACTSCANSTAT_ADDR 0x400000A4
#define BLE_ACTSCANSTAT_OFFSET 0x000000A4
#define BLE_ACTSCANSTAT_INDEX 0x00000029
#define BLE_ACTSCANSTAT_RESET 0x00010001

__INLINE uint32_t ble_actscanstat_get(void) {
  return REG_BLE_RD(BLE_ACTSCANSTAT_ADDR);
}

// field definitions
#define BLE_BACKOFF_MASK ((uint32_t)0x01FF0000)
#define BLE_BACKOFF_LSB 16
#define BLE_BACKOFF_WIDTH ((uint32_t)0x00000009)
#define BLE_UPPERLIMIT_MASK ((uint32_t)0x000001FF)
#define BLE_UPPERLIMIT_LSB 0
#define BLE_UPPERLIMIT_WIDTH ((uint32_t)0x00000009)

#define BLE_BACKOFF_RST 0x1
#define BLE_UPPERLIMIT_RST 0x1

__INLINE void ble_actscanstat_unpack(uint16_t* backoff, uint16_t* upperlimit) {
  uint32_t localVal = REG_BLE_RD(BLE_ACTSCANSTAT_ADDR);

  *backoff = (localVal & ((uint32_t)0x01FF0000)) >> 16;
  *upperlimit = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t ble_backoff_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ACTSCANSTAT_ADDR);
  return ((localVal & ((uint32_t)0x01FF0000)) >> 16);
}

__INLINE uint16_t ble_upperlimit_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_ACTSCANSTAT_ADDR);
  return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

/**
 * @brief WLPUBADDPTR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00          WLPUBADDPTR   0x0
 * </pre>
 */
#define BLE_WLPUBADDPTR_ADDR 0x400000B0
#define BLE_WLPUBADDPTR_OFFSET 0x000000B0
#define BLE_WLPUBADDPTR_INDEX 0x0000002C
#define BLE_WLPUBADDPTR_RESET 0x00000000

__INLINE uint32_t ble_wlpubaddptr_get(void) {
  return REG_BLE_RD(BLE_WLPUBADDPTR_ADDR);
}

__INLINE void ble_wlpubaddptr_set(uint32_t value) {
  REG_BLE_WR(BLE_WLPUBADDPTR_ADDR, value);
}

// field definitions
#define BLE_WLPUBADDPTR_MASK ((uint32_t)0x0000FFFF)
#define BLE_WLPUBADDPTR_LSB 0
#define BLE_WLPUBADDPTR_WIDTH ((uint32_t)0x00000010)

#define BLE_WLPUBADDPTR_RST 0x0

__INLINE uint16_t ble_wlpubaddptr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLPUBADDPTR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_wlpubaddptr_setf(uint16_t wlpubaddptr) {
  ASSERT_ERR((((uint32_t)wlpubaddptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_WLPUBADDPTR_ADDR, (uint32_t)wlpubaddptr << 0);
}

/**
 * @brief WLPRIVADDPTR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00         WLPRIVADDPTR   0x0
 * </pre>
 */
#define BLE_WLPRIVADDPTR_ADDR 0x400000B4
#define BLE_WLPRIVADDPTR_OFFSET 0x000000B4
#define BLE_WLPRIVADDPTR_INDEX 0x0000002D
#define BLE_WLPRIVADDPTR_RESET 0x00000000

__INLINE uint32_t ble_wlprivaddptr_get(void) {
  return REG_BLE_RD(BLE_WLPRIVADDPTR_ADDR);
}

__INLINE void ble_wlprivaddptr_set(uint32_t value) {
  REG_BLE_WR(BLE_WLPRIVADDPTR_ADDR, value);
}

