kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_WLPRIVADDPTR_MASK ((uint32_t)0x0000FFFF)
#define BLE_WLPRIVADDPTR_LSB 0
#define BLE_WLPRIVADDPTR_WIDTH ((uint32_t)0x00000010)

#define BLE_WLPRIVADDPTR_RST 0x0

__INLINE uint16_t ble_wlprivaddptr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLPRIVADDPTR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_wlprivaddptr_setf(uint16_t wlprivaddptr) {
  ASSERT_ERR((((uint32_t)wlprivaddptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_WLPRIVADDPTR_ADDR, (uint32_t)wlprivaddptr << 0);
}

/**
 * @brief WLNBDEV register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:08            NBPRIVDEV   0x0
 *  07:00             NBPUBDEV   0x0
 * </pre>
 */
#define BLE_WLNBDEV_ADDR 0x400000B8
#define BLE_WLNBDEV_OFFSET 0x000000B8
#define BLE_WLNBDEV_INDEX 0x0000002E
#define BLE_WLNBDEV_RESET 0x00000000

__INLINE uint32_t ble_wlnbdev_get(void) { return REG_BLE_RD(BLE_WLNBDEV_ADDR); }

__INLINE void ble_wlnbdev_set(uint32_t value) {
  REG_BLE_WR(BLE_WLNBDEV_ADDR, value);
}

// field definitions
#define BLE_NBPRIVDEV_MASK ((uint32_t)0x0000FF00)
#define BLE_NBPRIVDEV_LSB 8
#define BLE_NBPRIVDEV_WIDTH ((uint32_t)0x00000008)
#define BLE_NBPUBDEV_MASK ((uint32_t)0x000000FF)
#define BLE_NBPUBDEV_LSB 0
#define BLE_NBPUBDEV_WIDTH ((uint32_t)0x00000008)

#define BLE_NBPRIVDEV_RST 0x0
#define BLE_NBPUBDEV_RST 0x0

__INLINE void ble_wlnbdev_pack(uint8_t nbprivdev, uint8_t nbpubdev) {
  ASSERT_ERR((((uint32_t)nbprivdev << 8) & ~((uint32_t)0x0000FF00)) == 0);
  ASSERT_ERR((((uint32_t)nbpubdev << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_WLNBDEV_ADDR,
             ((uint32_t)nbprivdev << 8) | ((uint32_t)nbpubdev << 0));
}

__INLINE void ble_wlnbdev_unpack(uint8_t* nbprivdev, uint8_t* nbpubdev) {
  uint32_t localVal = REG_BLE_RD(BLE_WLNBDEV_ADDR);

  *nbprivdev = (localVal & ((uint32_t)0x0000FF00)) >> 8;
  *nbpubdev = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_nbprivdev_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLNBDEV_ADDR);
  return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void ble_nbprivdev_setf(uint8_t nbprivdev) {
  ASSERT_ERR((((uint32_t)nbprivdev << 8) & ~((uint32_t)0x0000FF00)) == 0);
  REG_BLE_WR(BLE_WLNBDEV_ADDR,
             (REG_BLE_RD(BLE_WLNBDEV_ADDR) & ~((uint32_t)0x0000FF00)) |
                 ((uint32_t)nbprivdev << 8));
}

__INLINE uint8_t ble_nbpubdev_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLNBDEV_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_nbpubdev_setf(uint8_t nbpubdev) {
  ASSERT_ERR((((uint32_t)nbpubdev << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_WLNBDEV_ADDR,
             (REG_BLE_RD(BLE_WLNBDEV_ADDR) & ~((uint32_t)0x000000FF)) |
                 ((uint32_t)nbpubdev << 0));
}

/**
 * @brief AESCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00            AES_START   0
 * </pre>
 */
#define BLE_AESCNTL_ADDR 0x400000C0
#define BLE_AESCNTL_OFFSET 0x000000C0
#define BLE_AESCNTL_INDEX 0x00000030
#define BLE_AESCNTL_RESET 0x00000000

__INLINE uint32_t ble_aescntl_get(void) { return REG_BLE_RD(BLE_AESCNTL_ADDR); }

__INLINE void ble_aescntl_set(uint32_t value) {
  REG_BLE_WR(BLE_AESCNTL_ADDR, value);
}

// field definitions
#define BLE_AES_START_BIT ((uint32_t)0x00000001)
#define BLE_AES_START_POS 0

#define BLE_AES_START_RST 0x0

__INLINE uint8_t ble_aes_start_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESCNTL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aes_start_setf(uint8_t aesstart) {
  ASSERT_ERR((((uint32_t)aesstart << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_AESCNTL_ADDR, (uint32_t)aesstart << 0);
}

/**
 * @brief AESKEY31_0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00           AESKEY31_0   0x0
 * </pre>
 */
#define BLE_AESKEY31_0_ADDR 0x400000C4
#define BLE_AESKEY31_0_OFFSET 0x000000C4
#define BLE_AESKEY31_0_INDEX 0x00000031
#define BLE_AESKEY31_0_RESET 0x00000000

__INLINE uint32_t ble_aeskey31_0_get(void) {
  return REG_BLE_RD(BLE_AESKEY31_0_ADDR);
}

__INLINE void ble_aeskey31_0_set(uint32_t value) {
  REG_BLE_WR(BLE_AESKEY31_0_ADDR, value);
}

// field definitions
#define BLE_AESKEY31_0_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_AESKEY31_0_LSB 0
#define BLE_AESKEY31_0_WIDTH ((uint32_t)0x00000020)

#define BLE_AESKEY31_0_RST 0x0

__INLINE uint32_t ble_aeskey31_0_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESKEY31_0_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aeskey31_0_setf(uint32_t aeskey310) {
  ASSERT_ERR((((uint32_t)aeskey310 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_AESKEY31_0_ADDR, (uint32_t)aeskey310 << 0);
}

/**
 * @brief AESKEY63_32 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00          AESKEY63_32   0x0
 * </pre>
 */
#define BLE_AESKEY63_32_ADDR 0x400000C8
#define BLE_AESKEY63_32_OFFSET 0x000000C8
#define BLE_AESKEY63_32_INDEX 0x00000032
#define BLE_AESKEY63_32_RESET 0x00000000

__INLINE uint32_t ble_aeskey63_32_get(void) {
  return REG_BLE_RD(BLE_AESKEY63_32_ADDR);
}

__INLINE void ble_aeskey63_32_set(uint32_t value) {
  REG_BLE_WR(BLE_AESKEY63_32_ADDR, value);
}

// field definitions
#define BLE_AESKEY63_32_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_AESKEY63_32_LSB 0
#define BLE_AESKEY63_32_WIDTH ((uint32_t)0x00000020)

#define BLE_AESKEY63_32_RST 0x0

__INLINE uint32_t ble_aeskey63_32_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESKEY63_32_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aeskey63_32_setf(uint32_t aeskey6332) {
  ASSERT_ERR((((uint32_t)aeskey6332 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_AESKEY63_32_ADDR, (uint32_t)aeskey6332 << 0);
}

/**
 * @brief AESKEY95_64 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00          AESKEY95_64   0x0
 * </pre>
 */
#define BLE_AESKEY95_64_ADDR 0x400000CC
#define BLE_AESKEY95_64_OFFSET 0x000000CC
#define BLE_AESKEY95_64_INDEX 0x00000033
#define BLE_AESKEY95_64_RESET 0x00000000

__INLINE uint32_t ble_aeskey95_64_get(void) {
  return REG_BLE_RD(BLE_AESKEY95_64_ADDR);
}

__INLINE void ble_aeskey95_64_set(uint32_t value) {
  REG_BLE_WR(BLE_AESKEY95_64_ADDR, value);
}

