kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_AESKEY95_64_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_AESKEY95_64_LSB 0
#define BLE_AESKEY95_64_WIDTH ((uint32_t)0x00000020)

#define BLE_AESKEY95_64_RST 0x0

__INLINE uint32_t ble_aeskey95_64_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESKEY95_64_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aeskey95_64_setf(uint32_t aeskey9564) {
  ASSERT_ERR((((uint32_t)aeskey9564 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_AESKEY95_64_ADDR, (uint32_t)aeskey9564 << 0);
}

/**
 * @brief AESKEY127_96 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00         AESKEY127_96   0x0
 * </pre>
 */
#define BLE_AESKEY127_96_ADDR 0x400000D0
#define BLE_AESKEY127_96_OFFSET 0x000000D0
#define BLE_AESKEY127_96_INDEX 0x00000034
#define BLE_AESKEY127_96_RESET 0x00000000

__INLINE uint32_t ble_aeskey127_96_get(void) {
  return REG_BLE_RD(BLE_AESKEY127_96_ADDR);
}

__INLINE void ble_aeskey127_96_set(uint32_t value) {
  REG_BLE_WR(BLE_AESKEY127_96_ADDR, value);
}

// field definitions
#define BLE_AESKEY127_96_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_AESKEY127_96_LSB 0
#define BLE_AESKEY127_96_WIDTH ((uint32_t)0x00000020)

#define BLE_AESKEY127_96_RST 0x0

__INLINE uint32_t ble_aeskey127_96_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESKEY127_96_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aeskey127_96_setf(uint32_t aeskey12796) {
  ASSERT_ERR((((uint32_t)aeskey12796 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
  REG_BLE_WR(BLE_AESKEY127_96_ADDR, (uint32_t)aeskey12796 << 0);
}

/**
 * @brief AESPTR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00               AESPTR   0x0
 * </pre>
 */
#define BLE_AESPTR_ADDR 0x400000D4
#define BLE_AESPTR_OFFSET 0x000000D4
#define BLE_AESPTR_INDEX 0x00000035
#define BLE_AESPTR_RESET 0x00000000

__INLINE uint32_t ble_aesptr_get(void) { return REG_BLE_RD(BLE_AESPTR_ADDR); }

__INLINE void ble_aesptr_set(uint32_t value) {
  REG_BLE_WR(BLE_AESPTR_ADDR, value);
}

// field definitions
#define BLE_AESPTR_MASK ((uint32_t)0x0000FFFF)
#define BLE_AESPTR_LSB 0
#define BLE_AESPTR_WIDTH ((uint32_t)0x00000010)

#define BLE_AESPTR_RST 0x0

__INLINE uint16_t ble_aesptr_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_AESPTR_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_aesptr_setf(uint16_t aesptr) {
  ASSERT_ERR((((uint32_t)aesptr << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_AESPTR_ADDR, (uint32_t)aesptr << 0);
}

/**
 * @brief TXMICVAL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             TXMICVAL   0x0
 * </pre>
 */
#define BLE_TXMICVAL_ADDR 0x400000D8
#define BLE_TXMICVAL_OFFSET 0x000000D8
#define BLE_TXMICVAL_INDEX 0x00000036
#define BLE_TXMICVAL_RESET 0x00000000

__INLINE uint32_t ble_txmicval_get(void) {
  return REG_BLE_RD(BLE_TXMICVAL_ADDR);
}

// field definitions
#define BLE_TXMICVAL_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_TXMICVAL_LSB 0
#define BLE_TXMICVAL_WIDTH ((uint32_t)0x00000020)

#define BLE_TXMICVAL_RST 0x0

__INLINE uint32_t ble_txmicval_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_TXMICVAL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief RXMICVAL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00             RXMICVAL   0x0
 * </pre>
 */
#define BLE_RXMICVAL_ADDR 0x400000DC
#define BLE_RXMICVAL_OFFSET 0x000000DC
#define BLE_RXMICVAL_INDEX 0x00000037
#define BLE_RXMICVAL_RESET 0x00000000

__INLINE uint32_t ble_rxmicval_get(void) {
  return REG_BLE_RD(BLE_RXMICVAL_ADDR);
}

// field definitions
#define BLE_RXMICVAL_MASK ((uint32_t)0xFFFFFFFF)
#define BLE_RXMICVAL_LSB 0
#define BLE_RXMICVAL_WIDTH ((uint32_t)0x00000020)

#define BLE_RXMICVAL_RST 0x0

__INLINE uint32_t ble_rxmicval_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RXMICVAL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
  return (localVal >> 0);
}

/**
 * @brief RFTESTCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31           INFINITERX   0
 *     15           INFINITETX   0
 *     14          TXLENGTHSRC   0
 *     13             PRBSTYPE   0
 *     12             TXPLDSRC   0
 *  08:00             TXLENGTH   0x0
 * </pre>
 */
#define BLE_RFTESTCNTL_ADDR 0x400000E0
#define BLE_RFTESTCNTL_OFFSET 0x000000E0
#define BLE_RFTESTCNTL_INDEX 0x00000038
#define BLE_RFTESTCNTL_RESET 0x00000000

__INLINE uint32_t ble_rftestcntl_get(void) {
  return REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
}

__INLINE void ble_rftestcntl_set(uint32_t value) {
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR, value);
}

// field definitions
#define BLE_INFINITERX_BIT ((uint32_t)0x80000000)
#define BLE_INFINITERX_POS 31
#define BLE_INFINITETX_BIT ((uint32_t)0x00008000)
#define BLE_INFINITETX_POS 15
#define BLE_TXLENGTHSRC_BIT ((uint32_t)0x00004000)
#define BLE_TXLENGTHSRC_POS 14
#define BLE_PRBSTYPE_BIT ((uint32_t)0x00002000)
#define BLE_PRBSTYPE_POS 13
#define BLE_TXPLDSRC_BIT ((uint32_t)0x00001000)
#define BLE_TXPLDSRC_POS 12
#define BLE_TXLENGTH_MASK ((uint32_t)0x000001FF)
#define BLE_TXLENGTH_LSB 0
#define BLE_TXLENGTH_WIDTH ((uint32_t)0x00000009)

#define BLE_INFINITERX_RST 0x0
#define BLE_INFINITETX_RST 0x0
#define BLE_TXLENGTHSRC_RST 0x0
#define BLE_PRBSTYPE_RST 0x0
#define BLE_TXPLDSRC_RST 0x0
#define BLE_TXLENGTH_RST 0x0

__INLINE void ble_rftestcntl_pack(uint8_t infiniterx, uint8_t infinitetx,
                                  uint8_t txlengthsrc, uint8_t prbstype,
                                  uint8_t txpldsrc, uint16_t txlength) {
  ASSERT_ERR((((uint32_t)infiniterx << 31) & ~((uint32_t)0x80000000)) == 0);
  ASSERT_ERR((((uint32_t)infinitetx << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)txlengthsrc << 14) & ~((uint32_t)0x00004000)) == 0);
  ASSERT_ERR((((uint32_t)prbstype << 13) & ~((uint32_t)0x00002000)) == 0);
  ASSERT_ERR((((uint32_t)txpldsrc << 12) & ~((uint32_t)0x00001000)) == 0);
  ASSERT_ERR((((uint32_t)txlength << 0) & ~((uint32_t)0x000001FF)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             ((uint32_t)infiniterx << 31) | ((uint32_t)infinitetx << 15) |
                 ((uint32_t)txlengthsrc << 14) | ((uint32_t)prbstype << 13) |
                 ((uint32_t)txpldsrc << 12) | ((uint32_t)txlength << 0));
}

__INLINE void ble_rftestcntl_unpack(uint8_t* infiniterx, uint8_t* infinitetx,
                                    uint8_t* txlengthsrc, uint8_t* prbstype,
                                    uint8_t* txpldsrc, uint16_t* txlength) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);

