kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
  *infiniterx = (localVal & ((uint32_t)0x80000000)) >> 31;
  *infinitetx = (localVal & ((uint32_t)0x00008000)) >> 15;
  *txlengthsrc = (localVal & ((uint32_t)0x00004000)) >> 14;
  *prbstype = (localVal & ((uint32_t)0x00002000)) >> 13;
  *txpldsrc = (localVal & ((uint32_t)0x00001000)) >> 12;
  *txlength = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint8_t ble_infiniterx_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void ble_infiniterx_setf(uint8_t infiniterx) {
  ASSERT_ERR((((uint32_t)infiniterx << 31) & ~((uint32_t)0x80000000)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x80000000)) |
                 ((uint32_t)infiniterx << 31));
}

__INLINE uint8_t ble_infinitetx_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_infinitetx_setf(uint8_t infinitetx) {
  ASSERT_ERR((((uint32_t)infinitetx << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)infinitetx << 15));
}

__INLINE uint8_t ble_txlengthsrc_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00004000)) >> 14);
}

__INLINE void ble_txlengthsrc_setf(uint8_t txlengthsrc) {
  ASSERT_ERR((((uint32_t)txlengthsrc << 14) & ~((uint32_t)0x00004000)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x00004000)) |
                 ((uint32_t)txlengthsrc << 14));
}

__INLINE uint8_t ble_prbstype_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void ble_prbstype_setf(uint8_t prbstype) {
  ASSERT_ERR((((uint32_t)prbstype << 13) & ~((uint32_t)0x00002000)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x00002000)) |
                 ((uint32_t)prbstype << 13));
}

__INLINE uint8_t ble_txpldsrc_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void ble_txpldsrc_setf(uint8_t txpldsrc) {
  ASSERT_ERR((((uint32_t)txpldsrc << 12) & ~((uint32_t)0x00001000)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x00001000)) |
                 ((uint32_t)txpldsrc << 12));
}

__INLINE uint16_t ble_txlength_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_RFTESTCNTL_ADDR);
  return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void ble_txlength_setf(uint16_t txlength) {
  ASSERT_ERR((((uint32_t)txlength << 0) & ~((uint32_t)0x000001FF)) == 0);
  REG_BLE_WR(BLE_RFTESTCNTL_ADDR,
             (REG_BLE_RD(BLE_RFTESTCNTL_ADDR) & ~((uint32_t)0x000001FF)) |
                 ((uint32_t)txlength << 0));
}

/**
 * @brief TIMGENCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  08:00        PREFETCH_TIME   0x137
 * </pre>
 */
#define BLE_TIMGENCNTL_ADDR 0x400000F0
#define BLE_TIMGENCNTL_OFFSET 0x000000F0
#define BLE_TIMGENCNTL_INDEX 0x0000003C
#define BLE_TIMGENCNTL_RESET 0x00000137

__INLINE uint32_t ble_timgencntl_get(void) {
  return REG_BLE_RD(BLE_TIMGENCNTL_ADDR);
}

__INLINE void ble_timgencntl_set(uint32_t value) {
  REG_BLE_WR(BLE_TIMGENCNTL_ADDR, value);
}

// field definitions
#define BLE_PREFETCH_TIME_MASK ((uint32_t)0x000001FF)
#define BLE_PREFETCH_TIME_LSB 0
#define BLE_PREFETCH_TIME_WIDTH ((uint32_t)0x00000009)

#define BLE_PREFETCH_TIME_RST 0x137

__INLINE uint16_t ble_prefetch_time_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_TIMGENCNTL_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x000001FF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_prefetch_time_setf(uint16_t prefetchtime) {
  ASSERT_ERR((((uint32_t)prefetchtime << 0) & ~((uint32_t)0x000001FF)) == 0);
  REG_BLE_WR(BLE_TIMGENCNTL_ADDR, (uint32_t)prefetchtime << 0);
}

/**
 * @brief GROSSTIMTGT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00          GROSSTARGET   0x0
 * </pre>
 */
#define BLE_GROSSTIMTGT_ADDR 0x400000F4
#define BLE_GROSSTIMTGT_OFFSET 0x000000F4
#define BLE_GROSSTIMTGT_INDEX 0x0000003D
#define BLE_GROSSTIMTGT_RESET 0x00000000

__INLINE uint32_t ble_grosstimtgt_get(void) {
  return REG_BLE_RD(BLE_GROSSTIMTGT_ADDR);
}

__INLINE void ble_grosstimtgt_set(uint32_t value) {
  REG_BLE_WR(BLE_GROSSTIMTGT_ADDR, value);
}

// field definitions
#define BLE_GROSSTARGET_MASK ((uint32_t)0x0000FFFF)
#define BLE_GROSSTARGET_LSB 0
#define BLE_GROSSTARGET_WIDTH ((uint32_t)0x00000010)

#define BLE_GROSSTARGET_RST 0x0

__INLINE uint16_t ble_grosstarget_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_GROSSTIMTGT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x0000FFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_grosstarget_setf(uint16_t grosstarget) {
  ASSERT_ERR((((uint32_t)grosstarget << 0) & ~((uint32_t)0x0000FFFF)) == 0);
  REG_BLE_WR(BLE_GROSSTIMTGT_ADDR, (uint32_t)grosstarget << 0);
}

/**
 * @brief FINETIMTGT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  26:00           FINETARGET   0x0
 * </pre>
 */
#define BLE_FINETIMTGT_ADDR 0x400000F8
#define BLE_FINETIMTGT_OFFSET 0x000000F8
#define BLE_FINETIMTGT_INDEX 0x0000003E
#define BLE_FINETIMTGT_RESET 0x00000000

__INLINE uint32_t ble_finetimtgt_get(void) {
  return REG_BLE_RD(BLE_FINETIMTGT_ADDR);
}

__INLINE void ble_finetimtgt_set(uint32_t value) {
  REG_BLE_WR(BLE_FINETIMTGT_ADDR, value);
}

// field definitions
#define BLE_FINETARGET_MASK ((uint32_t)0x07FFFFFF)
#define BLE_FINETARGET_LSB 0
#define BLE_FINETARGET_WIDTH ((uint32_t)0x0000001B)

#define BLE_FINETARGET_RST 0x0

__INLINE uint32_t ble_finetarget_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_FINETIMTGT_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x07FFFFFF)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_finetarget_setf(uint32_t finetarget) {
  ASSERT_ERR((((uint32_t)finetarget << 0) & ~((uint32_t)0x07FFFFFF)) == 0);
  REG_BLE_WR(BLE_FINETIMTGT_ADDR, (uint32_t)finetarget << 0);
}

/**
 * @brief SAMPLECLK register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00                 SAMP   0
 * </pre>
 */
#define BLE_SAMPLECLK_ADDR 0x400000FC
#define BLE_SAMPLECLK_OFFSET 0x000000FC
#define BLE_SAMPLECLK_INDEX 0x0000003F
#define BLE_SAMPLECLK_RESET 0x00000000

__INLINE uint32_t ble_sampleclk_get(void) {
  return REG_BLE_RD(BLE_SAMPLECLK_ADDR);
}

__INLINE void ble_sampleclk_set(uint32_t value) {
  REG_BLE_WR(BLE_SAMPLECLK_ADDR, value);
}

