kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_SAMP_BIT ((uint32_t)0x00000001)
#define BLE_SAMP_POS 0

#define BLE_SAMP_RST 0x0

__INLINE uint8_t ble_samp_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_SAMPLECLK_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
  return (localVal >> 0);
}

__INLINE void ble_samp_setf(uint8_t samp) {
  ASSERT_ERR((((uint32_t)samp << 0) & ~((uint32_t)0x00000001)) == 0);
  REG_BLE_WR(BLE_SAMPLECLK_ADDR, (uint32_t)samp << 0);
}

#if RW_BLE_WLAN_COEX
/**
 * @brief WLANCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  28:24        WLCPTHRESHOLD   0x0
 *  22:16         WLCPDURATION   0x0
 *  14:08            WLCPDELAY   0x0
 *     04           WLCRXTXPOL   0
 *  03:02          WLCPRIOMODE   0x0
 *  01:00              WLCMODE   0x0
 * </pre>
 */
#define BLE_WLANCNTL_ADDR 0x40000100
#define BLE_WLANCNTL_OFFSET 0x00000100
#define BLE_WLANCNTL_INDEX 0x00000040
#define BLE_WLANCNTL_RESET 0x00000000

__INLINE uint32_t ble_wlancntl_get(void) {
  return REG_BLE_RD(BLE_WLANCNTL_ADDR);
}

__INLINE void ble_wlancntl_set(uint32_t value) {
  REG_BLE_WR(BLE_WLANCNTL_ADDR, value);
}

// field definitions
#define BLE_WLCPTHRESHOLD_MASK ((uint32_t)0x1F000000)
#define BLE_WLCPTHRESHOLD_LSB 24
#define BLE_WLCPTHRESHOLD_WIDTH ((uint32_t)0x00000005)
#define BLE_WLCPDURATION_MASK ((uint32_t)0x007F0000)
#define BLE_WLCPDURATION_LSB 16
#define BLE_WLCPDURATION_WIDTH ((uint32_t)0x00000007)
#define BLE_WLCPDELAY_MASK ((uint32_t)0x00007F00)
#define BLE_WLCPDELAY_LSB 8
#define BLE_WLCPDELAY_WIDTH ((uint32_t)0x00000007)
#define BLE_WLCRXTXPOL_BIT ((uint32_t)0x00000010)
#define BLE_WLCRXTXPOL_POS 4
#define BLE_WLCPRIOMODE_MASK ((uint32_t)0x0000000C)
#define BLE_WLCPRIOMODE_LSB 2
#define BLE_WLCPRIOMODE_WIDTH ((uint32_t)0x00000002)
#define BLE_WLCMODE_MASK ((uint32_t)0x00000003)
#define BLE_WLCMODE_LSB 0
#define BLE_WLCMODE_WIDTH ((uint32_t)0x00000002)

#define BLE_WLCPTHRESHOLD_RST 0x0
#define BLE_WLCPDURATION_RST 0x0
#define BLE_WLCPDELAY_RST 0x0
#define BLE_WLCRXTXPOL_RST 0x0
#define BLE_WLCPRIOMODE_RST 0x0
#define BLE_WLCMODE_RST 0x0

__INLINE void ble_wlancntl_pack(uint8_t wlcpthreshold, uint8_t wlcpduration,
                                uint8_t wlcpdelay, uint8_t wlcrxtxpol,
                                uint8_t wlcpriomode, uint8_t wlcmode) {
  ASSERT_ERR((((uint32_t)wlcpthreshold << 24) & ~((uint32_t)0x1F000000)) == 0);
  ASSERT_ERR((((uint32_t)wlcpduration << 16) & ~((uint32_t)0x007F0000)) == 0);
  ASSERT_ERR((((uint32_t)wlcpdelay << 8) & ~((uint32_t)0x00007F00)) == 0);
  ASSERT_ERR((((uint32_t)wlcrxtxpol << 4) & ~((uint32_t)0x00000010)) == 0);
  ASSERT_ERR((((uint32_t)wlcpriomode << 2) & ~((uint32_t)0x0000000C)) == 0);
  ASSERT_ERR((((uint32_t)wlcmode << 0) & ~((uint32_t)0x00000003)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             ((uint32_t)wlcpthreshold << 24) | ((uint32_t)wlcpduration << 16) |
                 ((uint32_t)wlcpdelay << 8) | ((uint32_t)wlcrxtxpol << 4) |
                 ((uint32_t)wlcpriomode << 2) | ((uint32_t)wlcmode << 0));
}

__INLINE void ble_wlancntl_unpack(uint8_t* wlcpthreshold, uint8_t* wlcpduration,
                                  uint8_t* wlcpdelay, uint8_t* wlcrxtxpol,
                                  uint8_t* wlcpriomode, uint8_t* wlcmode) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);

  *wlcpthreshold = (localVal & ((uint32_t)0x1F000000)) >> 24;
  *wlcpduration = (localVal & ((uint32_t)0x007F0000)) >> 16;
  *wlcpdelay = (localVal & ((uint32_t)0x00007F00)) >> 8;
  *wlcrxtxpol = (localVal & ((uint32_t)0x00000010)) >> 4;
  *wlcpriomode = (localVal & ((uint32_t)0x0000000C)) >> 2;
  *wlcmode = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__INLINE uint8_t ble_wlcpthreshold_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x1F000000)) >> 24);
}

__INLINE void ble_wlcpthreshold_setf(uint8_t wlcpthreshold) {
  ASSERT_ERR((((uint32_t)wlcpthreshold << 24) & ~((uint32_t)0x1F000000)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x1F000000)) |
                 ((uint32_t)wlcpthreshold << 24));
}

__INLINE uint8_t ble_wlcpduration_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

__INLINE void ble_wlcpduration_setf(uint8_t wlcpduration) {
  ASSERT_ERR((((uint32_t)wlcpduration << 16) & ~((uint32_t)0x007F0000)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x007F0000)) |
                 ((uint32_t)wlcpduration << 16));
}

__INLINE uint8_t ble_wlcpdelay_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00007F00)) >> 8);
}

__INLINE void ble_wlcpdelay_setf(uint8_t wlcpdelay) {
  ASSERT_ERR((((uint32_t)wlcpdelay << 8) & ~((uint32_t)0x00007F00)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x00007F00)) |
                 ((uint32_t)wlcpdelay << 8));
}

__INLINE uint8_t ble_wlcrxtxpol_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_wlcrxtxpol_setf(uint8_t wlcrxtxpol) {
  ASSERT_ERR((((uint32_t)wlcrxtxpol << 4) & ~((uint32_t)0x00000010)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x00000010)) |
                 ((uint32_t)wlcrxtxpol << 4));
}

__INLINE uint8_t ble_wlcpriomode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

__INLINE void ble_wlcpriomode_setf(uint8_t wlcpriomode) {
  ASSERT_ERR((((uint32_t)wlcpriomode << 2) & ~((uint32_t)0x0000000C)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x0000000C)) |
                 ((uint32_t)wlcpriomode << 2));
}

__INLINE uint8_t ble_wlcmode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_WLANCNTL_ADDR);
  return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

