kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
__INLINE void ble_wlcmode_setf(uint8_t wlcmode) {
  ASSERT_ERR((((uint32_t)wlcmode << 0) & ~((uint32_t)0x00000003)) == 0);
  REG_BLE_WR(BLE_WLANCNTL_ADDR,
             (REG_BLE_RD(BLE_WLANCNTL_ADDR) & ~((uint32_t)0x00000003)) |
                 ((uint32_t)wlcmode << 0));
}

#endif  // RW_BLE_WLAN_COEX
#if RW_BLE_WLAN_COEX
/**
 * @brief BLEMPRIO0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28                BLEM7   0x3
 *  27:24                BLEM6   0x4
 *  23:20                BLEM5   0x8
 *  19:16                BLEM4   0x9
 *  15:12                BLEM3   0xA
 *  11:08                BLEM2   0xD
 *  07:04                BLEM1   0xE
 *  03:00                BLEM0   0xF
 * </pre>
 */
#define BLE_BLEMPRIO0_ADDR 0x40000104
#define BLE_BLEMPRIO0_OFFSET 0x00000104
#define BLE_BLEMPRIO0_INDEX 0x00000041
#define BLE_BLEMPRIO0_RESET 0x3489ADEF

__INLINE uint32_t ble_blemprio0_get(void) {
  return REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
}

__INLINE void ble_blemprio0_set(uint32_t value) {
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR, value);
}

// field definitions
#define BLE_BLEM7_MASK ((uint32_t)0xF0000000)
#define BLE_BLEM7_LSB 28
#define BLE_BLEM7_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM6_MASK ((uint32_t)0x0F000000)
#define BLE_BLEM6_LSB 24
#define BLE_BLEM6_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM5_MASK ((uint32_t)0x00F00000)
#define BLE_BLEM5_LSB 20
#define BLE_BLEM5_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM4_MASK ((uint32_t)0x000F0000)
#define BLE_BLEM4_LSB 16
#define BLE_BLEM4_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM3_MASK ((uint32_t)0x0000F000)
#define BLE_BLEM3_LSB 12
#define BLE_BLEM3_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM2_MASK ((uint32_t)0x00000F00)
#define BLE_BLEM2_LSB 8
#define BLE_BLEM2_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM1_MASK ((uint32_t)0x000000F0)
#define BLE_BLEM1_LSB 4
#define BLE_BLEM1_WIDTH ((uint32_t)0x00000004)
#define BLE_BLEM0_MASK ((uint32_t)0x0000000F)
#define BLE_BLEM0_LSB 0
#define BLE_BLEM0_WIDTH ((uint32_t)0x00000004)

#define BLE_BLEM7_RST 0x3
#define BLE_BLEM6_RST 0x4
#define BLE_BLEM5_RST 0x8
#define BLE_BLEM4_RST 0x9
#define BLE_BLEM3_RST 0xA
#define BLE_BLEM2_RST 0xD
#define BLE_BLEM1_RST 0xE
#define BLE_BLEM0_RST 0xF

__INLINE void ble_blemprio0_pack(uint8_t blem7, uint8_t blem6, uint8_t blem5,
                                 uint8_t blem4, uint8_t blem3, uint8_t blem2,
                                 uint8_t blem1, uint8_t blem0) {
  ASSERT_ERR((((uint32_t)blem7 << 28) & ~((uint32_t)0xF0000000)) == 0);
  ASSERT_ERR((((uint32_t)blem6 << 24) & ~((uint32_t)0x0F000000)) == 0);
  ASSERT_ERR((((uint32_t)blem5 << 20) & ~((uint32_t)0x00F00000)) == 0);
  ASSERT_ERR((((uint32_t)blem4 << 16) & ~((uint32_t)0x000F0000)) == 0);
  ASSERT_ERR((((uint32_t)blem3 << 12) & ~((uint32_t)0x0000F000)) == 0);
  ASSERT_ERR((((uint32_t)blem2 << 8) & ~((uint32_t)0x00000F00)) == 0);
  ASSERT_ERR((((uint32_t)blem1 << 4) & ~((uint32_t)0x000000F0)) == 0);
  ASSERT_ERR((((uint32_t)blem0 << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             ((uint32_t)blem7 << 28) | ((uint32_t)blem6 << 24) |
                 ((uint32_t)blem5 << 20) | ((uint32_t)blem4 << 16) |
                 ((uint32_t)blem3 << 12) | ((uint32_t)blem2 << 8) |
                 ((uint32_t)blem1 << 4) | ((uint32_t)blem0 << 0));
}

__INLINE void ble_blemprio0_unpack(uint8_t* blem7, uint8_t* blem6,
                                   uint8_t* blem5, uint8_t* blem4,
                                   uint8_t* blem3, uint8_t* blem2,
                                   uint8_t* blem1, uint8_t* blem0) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);

  *blem7 = (localVal & ((uint32_t)0xF0000000)) >> 28;
  *blem6 = (localVal & ((uint32_t)0x0F000000)) >> 24;
  *blem5 = (localVal & ((uint32_t)0x00F00000)) >> 20;
  *blem4 = (localVal & ((uint32_t)0x000F0000)) >> 16;
  *blem3 = (localVal & ((uint32_t)0x0000F000)) >> 12;
  *blem2 = (localVal & ((uint32_t)0x00000F00)) >> 8;
  *blem1 = (localVal & ((uint32_t)0x000000F0)) >> 4;
  *blem0 = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t ble_blem7_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0xF0000000)) >> 28);
}

__INLINE void ble_blem7_setf(uint8_t blem7) {
  ASSERT_ERR((((uint32_t)blem7 << 28) & ~((uint32_t)0xF0000000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0xF0000000)) |
                 ((uint32_t)blem7 << 28));
}

__INLINE uint8_t ble_blem6_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void ble_blem6_setf(uint8_t blem6) {
  ASSERT_ERR((((uint32_t)blem6 << 24) & ~((uint32_t)0x0F000000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x0F000000)) |
                 ((uint32_t)blem6 << 24));
}

__INLINE uint8_t ble_blem5_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x00F00000)) >> 20);
}

__INLINE void ble_blem5_setf(uint8_t blem5) {
  ASSERT_ERR((((uint32_t)blem5 << 20) & ~((uint32_t)0x00F00000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x00F00000)) |
                 ((uint32_t)blem5 << 20));
}

__INLINE uint8_t ble_blem4_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x000F0000)) >> 16);
}

__INLINE void ble_blem4_setf(uint8_t blem4) {
  ASSERT_ERR((((uint32_t)blem4 << 16) & ~((uint32_t)0x000F0000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x000F0000)) |
                 ((uint32_t)blem4 << 16));
}

__INLINE uint8_t ble_blem3_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x0000F000)) >> 12);
}

__INLINE void ble_blem3_setf(uint8_t blem3) {
  ASSERT_ERR((((uint32_t)blem3 << 12) & ~((uint32_t)0x0000F000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x0000F000)) |
                 ((uint32_t)blem3 << 12));
}

__INLINE uint8_t ble_blem2_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x00000F00)) >> 8);
}

__INLINE void ble_blem2_setf(uint8_t blem2) {
  ASSERT_ERR((((uint32_t)blem2 << 8) & ~((uint32_t)0x00000F00)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x00000F00)) |
                 ((uint32_t)blem2 << 8));
}

__INLINE uint8_t ble_blem1_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void ble_blem1_setf(uint8_t blem1) {
  ASSERT_ERR((((uint32_t)blem1 << 4) & ~((uint32_t)0x000000F0)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x000000F0)) |
                 ((uint32_t)blem1 << 4));
}

__INLINE uint8_t ble_blem0_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO0_ADDR);
  return ((localVal & ((uint32_t)0x0000000F)) >> 0);
}

__INLINE void ble_blem0_setf(uint8_t blem0) {
  ASSERT_ERR((((uint32_t)blem0 << 0) & ~((uint32_t)0x0000000F)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO0_ADDR,
             (REG_BLE_RD(BLE_BLEMPRIO0_ADDR) & ~((uint32_t)0x0000000F)) |
                 ((uint32_t)blem0 << 0));
}

#endif  // RW_BLE_WLAN_COEX
#if RW_BLE_WLAN_COEX
/**
 * @brief BLEMPRIO1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28          BLEMDEFAULT   0x3
 * </pre>
 */
#define BLE_BLEMPRIO1_ADDR 0x40000108
#define BLE_BLEMPRIO1_OFFSET 0x00000108
#define BLE_BLEMPRIO1_INDEX 0x00000042
#define BLE_BLEMPRIO1_RESET 0x30000000

__INLINE uint32_t ble_blemprio1_get(void) {
  return REG_BLE_RD(BLE_BLEMPRIO1_ADDR);
}

__INLINE void ble_blemprio1_set(uint32_t value) {
  REG_BLE_WR(BLE_BLEMPRIO1_ADDR, value);
}

