kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/include/reg_blecore.h
// field definitions
#define BLE_BLEMDEFAULT_MASK ((uint32_t)0xF0000000)
#define BLE_BLEMDEFAULT_LSB 28
#define BLE_BLEMDEFAULT_WIDTH ((uint32_t)0x00000004)

#define BLE_BLEMDEFAULT_RST 0x3

__INLINE uint8_t ble_blemdefault_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEMPRIO1_ADDR);
  ASSERT_ERR((localVal & ~((uint32_t)0xF0000000)) == 0);
  return (localVal >> 28);
}

__INLINE void ble_blemdefault_setf(uint8_t blemdefault) {
  ASSERT_ERR((((uint32_t)blemdefault << 28) & ~((uint32_t)0xF0000000)) == 0);
  REG_BLE_WR(BLE_BLEMPRIO1_ADDR, (uint32_t)blemdefault << 28);
}

#endif  // RW_BLE_WLAN_COEX
#if RW_DM_SUPPORT
/**
 * @brief BLEPRIOSCHARB register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15          BLEPRIOMODE   0
 *  07:00            BLEMARGIN   0x0
 * </pre>
 */
#define BLE_BLEPRIOSCHARB_ADDR 0x40000110
#define BLE_BLEPRIOSCHARB_OFFSET 0x00000110
#define BLE_BLEPRIOSCHARB_INDEX 0x00000044
#define BLE_BLEPRIOSCHARB_RESET 0x00000000

__INLINE uint32_t ble_bleprioscharb_get(void) {
  return REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
}

__INLINE void ble_bleprioscharb_set(uint32_t value) {
  REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR, value);
}

// field definitions
#define BLE_BLEPRIOMODE_BIT ((uint32_t)0x00008000)
#define BLE_BLEPRIOMODE_POS 15
#define BLE_BLEMARGIN_MASK ((uint32_t)0x000000FF)
#define BLE_BLEMARGIN_LSB 0
#define BLE_BLEMARGIN_WIDTH ((uint32_t)0x00000008)

#define BLE_BLEPRIOMODE_RST 0x0
#define BLE_BLEMARGIN_RST 0x0

__INLINE void ble_bleprioscharb_pack(uint8_t blepriomode, uint8_t blemargin) {
  ASSERT_ERR((((uint32_t)blepriomode << 15) & ~((uint32_t)0x00008000)) == 0);
  ASSERT_ERR((((uint32_t)blemargin << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR,
             ((uint32_t)blepriomode << 15) | ((uint32_t)blemargin << 0));
}

__INLINE void ble_bleprioscharb_unpack(uint8_t* blepriomode,
                                       uint8_t* blemargin) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);

  *blepriomode = (localVal & ((uint32_t)0x00008000)) >> 15;
  *blemargin = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_blepriomode_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
  return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_blepriomode_setf(uint8_t blepriomode) {
  ASSERT_ERR((((uint32_t)blepriomode << 15) & ~((uint32_t)0x00008000)) == 0);
  REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR,
             (REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR) & ~((uint32_t)0x00008000)) |
                 ((uint32_t)blepriomode << 15));
}

__INLINE uint8_t ble_blemargin_getf(void) {
  uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
  return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_blemargin_setf(uint8_t blemargin) {
  ASSERT_ERR((((uint32_t)blemargin << 0) & ~((uint32_t)0x000000FF)) == 0);
  REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR,
             (REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR) & ~((uint32_t)0x000000FF)) |
                 ((uint32_t)blemargin << 0));
}

#endif  // RW_DM_SUPPORT

#endif  // _REG_BLECORE_H_
